export interface BankBranch {
  code: string;
  name: string;
  city: string;
}

// מאגר סניפי הבנקים (מקור: בנק ישראל / data.gov.il) — מפתח = קוד בנק
export const BANK_BRANCHES: Record<string, BankBranch[]> = {
 "1": [
  {
   "code": "10",
   "name": "ישראכרט",
   "city": "בני ברק"
  }
 ],
 "3": [
  {
   "code": "1",
   "name": "ישראל",
   "city": "תל אביב -יפו"
  },
  {
   "code": "900",
   "name": "תפעולי",
   "city": "תל אביב -יפו"
  }
 ],
 "4": [
  {
   "code": "7",
   "name": "מלחה ירושלים",
   "city": "ירושלים"
  },
  {
   "code": "44",
   "name": "הלל יפה חדרה",
   "city": "חדרה"
  },
  {
   "code": "110",
   "name": "מרכז תפעול עורפי*-מרחב צפון",
   "city": "ירושלים"
  },
  {
   "code": "111",
   "name": "מרכז תפעול עורפי*-מרחב מרכז",
   "city": "ירושלים"
  },
  {
   "code": "112",
   "name": "מרכז תפעול עורפי-מרחב ירושלים",
   "city": "ירושלים"
  },
  {
   "code": "113",
   "name": "מרכז תפעול עורפי  מרחב דרום",
   "city": "ירושלים"
  },
  {
   "code": "114",
   "name": "אשדוד",
   "city": "אשדוד"
  },
  {
   "code": "115",
   "name": "קריית הממשלה ת\"א - מגדל היובל",
   "city": "תל אביב -יפו"
  },
  {
   "code": "116",
   "name": "מודיעין",
   "city": "מודיעין-מכבים-רעות*"
  },
  {
   "code": "117",
   "name": "מרכז הנגב",
   "city": "באר שבע"
  },
  {
   "code": "118",
   "name": "כפר סבא",
   "city": "כפר סבא"
  },
  {
   "code": "119",
   "name": "פתח תקווה",
   "city": "פתח תקווה"
  },
  {
   "code": "120",
   "name": "ראשי ירושלים",
   "city": "ירושלים"
  },
  {
   "code": "121",
   "name": "קדם",
   "city": "ירושלים"
  },
  {
   "code": "123",
   "name": "בית יהב",
   "city": "ירושלים"
  },
  {
   "code": "124",
   "name": "באר שבע",
   "city": "באר שבע"
  },
  {
   "code": "125",
   "name": "אשקלון",
   "city": "אשקלון"
  },
  {
   "code": "126",
   "name": "מוקד טלפוני יהב ישיר",
   "city": "ירושלים"
  },
  {
   "code": "128",
   "name": "קריית גת",
   "city": "קריית גת"
  },
  {
   "code": "129",
   "name": "כנפי נשרים",
   "city": "ירושלים"
  },
  {
   "code": "130",
   "name": "רוטשילד",
   "city": "תל אביב -יפו"
  },
  {
   "code": "131",
   "name": "הקריה  תל אביב",
   "city": "תל אביב -יפו"
  },
  {
   "code": "132",
   "name": "תל השומר",
   "city": "רמת גן"
  },
  {
   "code": "133",
   "name": "נתניה",
   "city": "נתניה"
  },
  {
   "code": "134",
   "name": "נתב\"ג",
   "city": "אזור רמלה של\"ש"
  },
  {
   "code": "135",
   "name": "סניפון וולפסון- חולון",
   "city": "חולון"
  },
  {
   "code": "136",
   "name": "ראשון לציון",
   "city": "ראשון לציון"
  },
  {
   "code": "137",
   "name": "אסף הרופא",
   "city": "באר יעקב"
  },
  {
   "code": "138",
   "name": "חדרה",
   "city": "חדרה"
  },
  {
   "code": "140",
   "name": "חיפה",
   "city": "חיפה"
  },
  {
   "code": "141",
   "name": "נהרייה",
   "city": "נהרייה"
  },
  {
   "code": "142",
   "name": "נוף הגליל",
   "city": "נוף הגליל"
  },
  {
   "code": "145",
   "name": "קרנות השתלמות",
   "city": "ירושלים"
  },
  {
   "code": "146",
   "name": "תוכניות חסכון",
   "city": "ירושלים"
  },
  {
   "code": "148",
   "name": "אשראי",
   "city": "ירושלים"
  },
  {
   "code": "149",
   "name": "הנהלה ראשית",
   "city": "ירושלים"
  },
  {
   "code": "150",
   "name": "באר יעקב",
   "city": "באר יעקב"
  },
  {
   "code": "171",
   "name": "בת ים",
   "city": "בת ים"
  },
  {
   "code": "193",
   "name": "מעלה אדומים",
   "city": "מעלה אדומים"
  },
  {
   "code": "195",
   "name": "איכלוב",
   "city": "תל אביב -יפו"
  },
  {
   "code": "201",
   "name": "שלוחה בהדסה",
   "city": "ירושלים"
  },
  {
   "code": "202",
   "name": "דלית אל כרמל",
   "city": "דאלית אל-כרמל"
  },
  {
   "code": "203",
   "name": "נתיבות",
   "city": "נתיבות"
  },
  {
   "code": "204",
   "name": "תלפיות",
   "city": "ירושלים"
  },
  {
   "code": "205",
   "name": "דימונה",
   "city": "דימונה"
  },
  {
   "code": "206",
   "name": "ראש העין",
   "city": "ראש העין"
  },
  {
   "code": "207",
   "name": "קרית אתא",
   "city": "קריית אתא"
  },
  {
   "code": "211",
   "name": "קריית אונו",
   "city": "קריית אונו"
  },
  {
   "code": "212",
   "name": "גלילות",
   "city": "רמת השרון"
  },
  {
   "code": "233",
   "name": "רמב\"ם",
   "city": "חיפה"
  },
  {
   "code": "236",
   "name": "הרצליה",
   "city": "הרצלייה"
  },
  {
   "code": "245",
   "name": "עפולה",
   "city": "עפולה"
  },
  {
   "code": "246",
   "name": "סניף טבריה",
   "city": "טבריה"
  },
  {
   "code": "278",
   "name": "סניף רחובות",
   "city": "רחובות"
  },
  {
   "code": "279",
   "name": "קריית ביאליק",
   "city": "קריית ביאליק"
  },
  {
   "code": "280",
   "name": "כרמיאל",
   "city": "כרמיאל"
  },
  {
   "code": "281",
   "name": "אילת",
   "city": "אילת"
  },
  {
   "code": "284",
   "name": "חולון",
   "city": "חולון"
  },
  {
   "code": "311",
   "name": "כרמל",
   "city": "חיפה"
  },
  {
   "code": "401",
   "name": "רמת גן",
   "city": "רמת גן"
  },
  {
   "code": "430",
   "name": "לב ראשון",
   "city": "ראשון לציון"
  },
  {
   "code": "461",
   "name": "בית שמש",
   "city": "בית שמש"
  },
  {
   "code": "488",
   "name": "משכנות האומה",
   "city": "ירושלים"
  },
  {
   "code": "497",
   "name": "פסגת זאב",
   "city": "ירושלים"
  },
  {
   "code": "725",
   "name": "יקנעם עילית",
   "city": "יקנעם עילית"
  },
  {
   "code": "824",
   "name": "שדרות",
   "city": "שדרות"
  },
  {
   "code": "825",
   "name": "מגדל העמק",
   "city": "מגדל העמק"
  }
 ],
 "6": [
  {
   "code": "1",
   "name": "מקס ראשי",
   "city": "בני ברק"
  }
 ],
 "10": [
  {
   "code": "263",
   "name": "משכנתאות קרני שומרון",
   "city": "קרני שומרון"
  },
  {
   "code": "281",
   "name": "מרכז החתמת משכנתא קש\"ב לוד",
   "city": "לוד"
  },
  {
   "code": "606",
   "name": "בנקאות פרטית בינלאומית 606 ת\"א",
   "city": "תל אביב -יפו"
  },
  {
   "code": "607",
   "name": "מרכז עסקים נגב",
   "city": "באר שבע"
  },
  {
   "code": "609",
   "name": "מרכז ייעוץ היברידי",
   "city": "רחובות"
  },
  {
   "code": "613",
   "name": "קלנסואה",
   "city": "קלנסווה"
  },
  {
   "code": "615",
   "name": "כאבול",
   "city": "כאבול"
  },
  {
   "code": "618",
   "name": "מרכז עסקים לכיש",
   "city": "אשדוד"
  },
  {
   "code": "621",
   "name": "מודיעין עילית",
   "city": "מודיעין עילית"
  },
  {
   "code": "626",
   "name": "בנקאות פרטית דן",
   "city": "תל אביב -יפו"
  },
  {
   "code": "631",
   "name": "רמת אביב למד",
   "city": "תל אביב -יפו"
  },
  {
   "code": "635",
   "name": "דניה",
   "city": "חיפה"
  },
  {
   "code": "638",
   "name": "מבשרת ציון",
   "city": "מבשרת ציון"
  },
  {
   "code": "640",
   "name": "מוקד חשבונות ללא קשר",
   "city": "לוד"
  },
  {
   "code": "641",
   "name": "עסקים גליל מערבי",
   "city": "נהרייה"
  },
  {
   "code": "644",
   "name": "כפר כנא",
   "city": "כפר כנא"
  },
  {
   "code": "646",
   "name": "יחידת בצוע-נהול אשראי מרוכז",
   "city": "לוד"
  },
  {
   "code": "647",
   "name": "עסקים גבעת שאול",
   "city": "ירושלים"
  },
  {
   "code": "648",
   "name": "עסקים נתניה",
   "city": "נתניה"
  },
  {
   "code": "652",
   "name": "כפר קאסם",
   "city": "כפר קאסם"
  },
  {
   "code": "655",
   "name": "קסם",
   "city": "רמת גן"
  },
  {
   "code": "658",
   "name": "מ.גידורים והשק' - מרכז",
   "city": "רמת גן"
  },
  {
   "code": "661",
   "name": "מרכז קופות ירושלים",
   "city": "ירושלים"
  },
  {
   "code": "662",
   "name": "סיטי אשדוד",
   "city": "אשדוד"
  },
  {
   "code": "663",
   "name": "מרכז קופות באר שבע",
   "city": "באר שבע"
  },
  {
   "code": "666",
   "name": "עסקים הבורסה רמת גן",
   "city": "רמת גן"
  },
  {
   "code": "668",
   "name": "עסקים שורק",
   "city": "רמלה"
  },
  {
   "code": "669",
   "name": "היקב ראשון לציון",
   "city": "ראשון לציון"
  },
  {
   "code": "672",
   "name": "עסקים עפולה",
   "city": "עפולה"
  },
  {
   "code": "674",
   "name": "רמת בית שמש",
   "city": "בית שמש"
  },
  {
   "code": "676",
   "name": "אור יהודה",
   "city": "אור יהודה"
  },
  {
   "code": "678",
   "name": "לאומי וי איי פי",
   "city": "ראשון לציון"
  },
  {
   "code": "679",
   "name": "מבואות עצמאיות",
   "city": "לוד"
  },
  {
   "code": "680",
   "name": "מודיעין",
   "city": "מודיעין-מכבים-רעות*"
  },
  {
   "code": "681",
   "name": "רמת פולג",
   "city": "נתניה"
  },
  {
   "code": "683",
   "name": "כוכב יאיר",
   "city": "כפר סבא"
  },
  {
   "code": "685",
   "name": "בנקאות פרטית חיפה",
   "city": "חיפה"
  },
  {
   "code": "686",
   "name": "בנקאות פרטית ת\"א",
   "city": "תל אביב -יפו"
  },
  {
   "code": "688",
   "name": "בנקאות פרטית השרון",
   "city": "הרצלייה"
  },
  {
   "code": "696",
   "name": "מרכז בנקאות י-ם",
   "city": "ירושלים"
  },
  {
   "code": "698",
   "name": "עסקים ספיר",
   "city": "כוכב יאיר"
  },
  {
   "code": "701",
   "name": "לאומי טוטאל דיגיטל",
   "city": "ראשון לציון"
  },
  {
   "code": "702",
   "name": "עסקים מבואות חיפה",
   "city": "חיפה"
  },
  {
   "code": "705",
   "name": "קרית מוצקין",
   "city": "קריית מוצקין"
  },
  {
   "code": "706",
   "name": "פרדסיה",
   "city": "תל מונד"
  },
  {
   "code": "709",
   "name": "עסקים פתח תקווה",
   "city": "פתח תקווה"
  },
  {
   "code": "711",
   "name": "מרכז חוב\"ב צפון",
   "city": "נשר"
  },
  {
   "code": "719",
   "name": "קרית ביאליק",
   "city": "קריית ביאליק"
  },
  {
   "code": "722",
   "name": "חרפיש",
   "city": "חורפיש"
  },
  {
   "code": "725",
   "name": "עסקים פארק המדע",
   "city": "נס ציונה"
  },
  {
   "code": "727",
   "name": "ראש פינה",
   "city": "ראש פינה"
  },
  {
   "code": "729",
   "name": "יקנעם",
   "city": "יקנעם עילית"
  },
  {
   "code": "732",
   "name": "קצרין",
   "city": "קצרין"
  },
  {
   "code": "734",
   "name": "נווה זאב",
   "city": "באר שבע"
  },
  {
   "code": "736",
   "name": "לאומי וי איי פי",
   "city": "ראשון לציון"
  },
  {
   "code": "739",
   "name": "גן יבנה",
   "city": "גן יבנה"
  },
  {
   "code": "742",
   "name": "ראש העין",
   "city": "ראש העין"
  },
  {
   "code": "744",
   "name": "מרכז עסקים השרון",
   "city": "נתניה"
  },
  {
   "code": "745",
   "name": "מרכז עסקים העמקים",
   "city": "עפולה"
  },
  {
   "code": "746",
   "name": "מרכז קופות פתח תקוה",
   "city": "פתח תקווה"
  },
  {
   "code": "747",
   "name": "שוהם",
   "city": "שוהם"
  },
  {
   "code": "748",
   "name": "מרכז עסקים דן",
   "city": "רמת גן"
  },
  {
   "code": "749",
   "name": "מרכז ייעוץ רמת השרון",
   "city": "רמת השרון"
  },
  {
   "code": "751",
   "name": "מרכז יייעוץ בהשקעות ים",
   "city": "ירושלים"
  },
  {
   "code": "752",
   "name": "מעלה אדומים",
   "city": "מעלה אדומים"
  },
  {
   "code": "753",
   "name": "עסקים ראש פינה",
   "city": "ראש פינה"
  },
  {
   "code": "756",
   "name": "מרכז ייעוץ השק' שפלה",
   "city": "רחובות"
  },
  {
   "code": "757",
   "name": "ג'לג'וליה",
   "city": "ג'לג'וליה"
  },
  {
   "code": "758",
   "name": "ערד",
   "city": "ערד"
  },
  {
   "code": "761",
   "name": "גוש חלב",
   "city": "ג'ש (גוש חלב)"
  },
  {
   "code": "766",
   "name": "בית וגן",
   "city": "ירושלים"
  },
  {
   "code": "767",
   "name": "מרכז עסקים חולון",
   "city": "חולון"
  },
  {
   "code": "773",
   "name": "מרכז ייעוץ הרצליה",
   "city": "הרצלייה"
  },
  {
   "code": "780",
   "name": "בנקאות פרטית בינלאומית ירושלים",
   "city": "ירושלים"
  },
  {
   "code": "781",
   "name": "מרכז שירות בת-ים",
   "city": "בת ים"
  },
  {
   "code": "783",
   "name": "עסקים הרצליה",
   "city": "הרצלייה"
  },
  {
   "code": "785",
   "name": "תלפיות",
   "city": "ירושלים"
  },
  {
   "code": "789",
   "name": "אופקים",
   "city": "אופקים"
  },
  {
   "code": "790",
   "name": "נתיבות",
   "city": "נתיבות"
  },
  {
   "code": "791",
   "name": "טורעאן",
   "city": "טורעאן"
  },
  {
   "code": "792",
   "name": "נחף",
   "city": "נחף"
  },
  {
   "code": "795",
   "name": "פקיעין",
   "city": "פקיעין (בוקייעה)"
  },
  {
   "code": "797",
   "name": "גבעת אורנים",
   "city": "ירושלים"
  },
  {
   "code": "800",
   "name": "מרכזי",
   "city": "לוד"
  },
  {
   "code": "801",
   "name": "יפו",
   "city": "תל אביב -יפו"
  },
  {
   "code": "803",
   "name": "ביאליק (תושבי חוץ)",
   "city": "תל אביב -יפו"
  },
  {
   "code": "805",
   "name": "עסקים פלורנטין",
   "city": "תל אביב -יפו"
  },
  {
   "code": "806",
   "name": "לב דיזנגוף",
   "city": "תל אביב -יפו"
  },
  {
   "code": "811",
   "name": "עסקים לב תל אביב",
   "city": "תל אביב -יפו"
  },
  {
   "code": "814",
   "name": "יד אליהו",
   "city": "תל אביב -יפו"
  },
  {
   "code": "816",
   "name": "כיכר רבין",
   "city": "תל אביב -יפו"
  },
  {
   "code": "817",
   "name": "מרכז עסקים תל אביב",
   "city": "תל אביב -יפו"
  },
  {
   "code": "820",
   "name": "אום אל פחם",
   "city": "אום אל-פחם"
  },
  {
   "code": "821",
   "name": "מרכז קופות תל אביב",
   "city": "תל אביב -יפו"
  },
  {
   "code": "825",
   "name": "כפר מנדא",
   "city": "כפר מנדא"
  },
  {
   "code": "826",
   "name": "מרכז פנסיוני חיפה",
   "city": "חיפה"
  },
  {
   "code": "827",
   "name": "עסקים חולון",
   "city": "חולון"
  },
  {
   "code": "828",
   "name": "עסקים פסגת השרון",
   "city": "כפר סבא"
  },
  {
   "code": "831",
   "name": "טמרה",
   "city": "טמרה"
  },
  {
   "code": "832",
   "name": "פנקס",
   "city": "תל אביב -יפו"
  },
  {
   "code": "833",
   "name": "רמת אביב אינשטיין",
   "city": "תל אביב -יפו"
  },
  {
   "code": "835",
   "name": "תל מונד",
   "city": "תל מונד"
  },
  {
   "code": "837",
   "name": "יהוד",
   "city": "יהוד-מונוסון"
  },
  {
   "code": "838",
   "name": "נאות אפקה",
   "city": "תל אביב -יפו"
  },
  {
   "code": "840",
   "name": "נצרת",
   "city": "נצרת"
  },
  {
   "code": "841",
   "name": "כפר ערערה",
   "city": "ערערה"
  },
  {
   "code": "842",
   "name": "עסקים שפרעם",
   "city": "שפרעם"
  },
  {
   "code": "843",
   "name": "קרית אונו",
   "city": "קריית אונו"
  },
  {
   "code": "844",
   "name": "כפר שמריהו",
   "city": "הרצלייה"
  },
  {
   "code": "845",
   "name": "מרכז יעוץ השקעות ב\"ש",
   "city": "באר שבע"
  },
  {
   "code": "847",
   "name": "מרכז פנסיוני ת\"א",
   "city": "תל אביב -יפו"
  },
  {
   "code": "849",
   "name": "המשרד המרכזי-החטיבה הפיננסית",
   "city": "לוד"
  },
  {
   "code": "851",
   "name": "רמת גן",
   "city": "רמת גן"
  },
  {
   "code": "855",
   "name": "עסקים הירקון",
   "city": "בני ברק"
  },
  {
   "code": "856",
   "name": "בני ברק",
   "city": "בני ברק"
  },
  {
   "code": "857",
   "name": "גבעתיים",
   "city": "גבעתיים"
  },
  {
   "code": "858",
   "name": "חולון",
   "city": "חולון"
  },
  {
   "code": "859",
   "name": "עסקים בת-ים",
   "city": "בת ים"
  },
  {
   "code": "861",
   "name": "בת ים",
   "city": "בת ים"
  },
  {
   "code": "862",
   "name": "דיר אל אסד-בענה",
   "city": "בענה"
  },
  {
   "code": "864",
   "name": "מרכז עסקים לאומי טק",
   "city": "תל אביב -יפו"
  },
  {
   "code": "865",
   "name": "עסקים תל אביב צפון",
   "city": "תל אביב -יפו"
  },
  {
   "code": "866",
   "name": "מרגנית",
   "city": "חולון"
  },
  {
   "code": "867",
   "name": "כפר יאסיף",
   "city": "כפר יאסיף"
  },
  {
   "code": "871",
   "name": "ירכא",
   "city": "ירכא"
  },
  {
   "code": "872",
   "name": "מרכז שירות ת\"א צפון",
   "city": "תל אביב -יפו"
  },
  {
   "code": "873",
   "name": "סכנין",
   "city": "סח'נין"
  },
  {
   "code": "876",
   "name": "מרכז עסקים חיפה",
   "city": "קריית ביאליק"
  },
  {
   "code": "877",
   "name": "קרית אליעזר",
   "city": "חיפה"
  },
  {
   "code": "879",
   "name": "חיפה",
   "city": "חיפה"
  },
  {
   "code": "880",
   "name": "חורב",
   "city": "חיפה"
  },
  {
   "code": "881",
   "name": "מרכז קופות חיפה",
   "city": "חיפה"
  },
  {
   "code": "882",
   "name": "נווה שאנן",
   "city": "חיפה"
  },
  {
   "code": "884",
   "name": "עסקים ג'וליס",
   "city": "ג'ולס"
  },
  {
   "code": "885",
   "name": "טירת הכרמל",
   "city": "טירת כרמל"
  },
  {
   "code": "887",
   "name": "עסקים הקריות",
   "city": "קריית אתא"
  },
  {
   "code": "890",
   "name": "חשבונות משכנתא",
   "city": "לוד"
  },
  {
   "code": "891",
   "name": "הכרמל",
   "city": "חיפה"
  },
  {
   "code": "895",
   "name": "קרית טבעון",
   "city": "קריית טבעון"
  },
  {
   "code": "896",
   "name": "עסקים רמת ישי",
   "city": "רמת ישי"
  },
  {
   "code": "897",
   "name": "קרית אתא",
   "city": "קריית אתא"
  },
  {
   "code": "899",
   "name": "לאומי וי איי פי",
   "city": "ראשון לציון"
  },
  {
   "code": "900",
   "name": "קרית ים",
   "city": "קריית מוצקין"
  },
  {
   "code": "901",
   "name": "מרכז עסקים ירושלים",
   "city": "ירושלים"
  },
  {
   "code": "902",
   "name": "המלך ג'ורג'",
   "city": "ירושלים"
  },
  {
   "code": "903",
   "name": "בית הכרם",
   "city": "ירושלים"
  },
  {
   "code": "904",
   "name": "שלוחת ביתר עילית",
   "city": "ביתר עילית"
  },
  {
   "code": "905",
   "name": "רמות אשכול",
   "city": "ירושלים"
  },
  {
   "code": "906",
   "name": "עסקים עירון",
   "city": "ערערה"
  },
  {
   "code": "907",
   "name": "עסקים חדרה",
   "city": "חדרה"
  },
  {
   "code": "908",
   "name": "אעבלין",
   "city": "אעבלין"
  },
  {
   "code": "909",
   "name": "עראבה",
   "city": "עראבה"
  },
  {
   "code": "911",
   "name": "גאולה",
   "city": "ירושלים"
  },
  {
   "code": "912",
   "name": "רחביה",
   "city": "ירושלים"
  },
  {
   "code": "914",
   "name": "לאומי וי איי פי",
   "city": "ראשון לציון"
  },
  {
   "code": "916",
   "name": "בית שמש",
   "city": "בית שמש"
  },
  {
   "code": "917",
   "name": "מרכז ייעוץ צפון",
   "city": "קריית אתא"
  },
  {
   "code": "918",
   "name": "מזרח ירושלים",
   "city": "ירושלים"
  },
  {
   "code": "919",
   "name": "מרכז קופות מזרח ירושלים",
   "city": "ירושלים"
  },
  {
   "code": "921",
   "name": "עסקים באר שבע",
   "city": "באר שבע"
  },
  {
   "code": "922",
   "name": "מרכז הנגב",
   "city": "באר שבע"
  },
  {
   "code": "923",
   "name": "דימונה",
   "city": "דימונה"
  },
  {
   "code": "924",
   "name": "באר שבע",
   "city": "באר שבע"
  },
  {
   "code": "925",
   "name": "עסקים אשקלון",
   "city": "אשקלון"
  },
  {
   "code": "926",
   "name": "אפרידר אשקלון",
   "city": "אשקלון"
  },
  {
   "code": "927",
   "name": "קרית גת",
   "city": "קריית גת"
  },
  {
   "code": "928",
   "name": "גדרה",
   "city": "גדרה"
  },
  {
   "code": "930",
   "name": "רחובות",
   "city": "רחובות"
  },
  {
   "code": "932",
   "name": "אשדוד",
   "city": "אשדוד"
  },
  {
   "code": "933",
   "name": "נס ציונה",
   "city": "נס ציונה"
  },
  {
   "code": "934",
   "name": "ראשון לציון מרכז",
   "city": "ראשון לציון"
  },
  {
   "code": "936",
   "name": "רמלה",
   "city": "רמלה"
  },
  {
   "code": "937",
   "name": "לוד",
   "city": "לוד"
  },
  {
   "code": "939",
   "name": "יבנה",
   "city": "יבנה"
  },
  {
   "code": "940",
   "name": "פתח תקוה",
   "city": "פתח תקווה"
  },
  {
   "code": "941",
   "name": "שדרות",
   "city": "שדרות"
  },
  {
   "code": "942",
   "name": "רעננה",
   "city": "רעננה"
  },
  {
   "code": "943",
   "name": "הוד השרון",
   "city": "הוד השרון"
  },
  {
   "code": "944",
   "name": "מערב ראשון",
   "city": "ראשון לציון"
  },
  {
   "code": "945",
   "name": "ראמה",
   "city": "ראמה"
  },
  {
   "code": "946",
   "name": "כפר סבא",
   "city": "כפר סבא"
  },
  {
   "code": "948",
   "name": "הרצליה",
   "city": "הרצלייה"
  },
  {
   "code": "949",
   "name": "רמת השרון",
   "city": "רמת השרון"
  },
  {
   "code": "950",
   "name": "לאומי וי איי פי",
   "city": "ראשון לציון"
  },
  {
   "code": "951",
   "name": "טייבה",
   "city": "טייבה"
  },
  {
   "code": "952",
   "name": "נתניה",
   "city": "נתניה"
  },
  {
   "code": "953",
   "name": "שלוחת חריש",
   "city": "חריש"
  },
  {
   "code": "954",
   "name": "פרדס חנה",
   "city": "פרדס חנה-כרכור"
  },
  {
   "code": "956",
   "name": "זכרון יעקב",
   "city": "זכרון יעקב"
  },
  {
   "code": "960",
   "name": "עכו",
   "city": "עכו"
  },
  {
   "code": "961",
   "name": "כרמיאל",
   "city": "כרמיאל"
  },
  {
   "code": "962",
   "name": "נהריה",
   "city": "נהרייה"
  },
  {
   "code": "963",
   "name": "מרכז שירות אשדוד",
   "city": "אשדוד"
  },
  {
   "code": "964",
   "name": "עסקים נצרת",
   "city": "נצרת"
  },
  {
   "code": "965",
   "name": "עפולה",
   "city": "עפולה"
  },
  {
   "code": "966",
   "name": "בית שאן",
   "city": "בית שאן"
  },
  {
   "code": "969",
   "name": "שפרעם",
   "city": "שפרעם"
  },
  {
   "code": "970",
   "name": "טבריה",
   "city": "טבריה"
  },
  {
   "code": "972",
   "name": "נוף הגליל",
   "city": "נוף הגליל"
  },
  {
   "code": "973",
   "name": "מעלות תרשיחא",
   "city": "מעלות-תרשיחא"
  },
  {
   "code": "974",
   "name": "מרכז שירות השרון",
   "city": "נתניה"
  },
  {
   "code": "975",
   "name": "צפת",
   "city": "צפת"
  },
  {
   "code": "976",
   "name": "קרית שמונה",
   "city": "קריית שמונה"
  },
  {
   "code": "977",
   "name": "בית ג'אן",
   "city": "בית ג'ן"
  },
  {
   "code": "978",
   "name": "מרכז עסקים ראשון",
   "city": "ראשון לציון"
  },
  {
   "code": "979",
   "name": "דבוריה",
   "city": "דבורייה"
  },
  {
   "code": "980",
   "name": "טירה",
   "city": "טירה"
  },
  {
   "code": "981",
   "name": "דאלית אל כרמל-עוספייה",
   "city": "דאלית אל-כרמל"
  },
  {
   "code": "983",
   "name": "באקה אל גרביה",
   "city": "באקה אל-גרביה"
  },
  {
   "code": "984",
   "name": "מעאר",
   "city": "מגאר"
  },
  {
   "code": "985",
   "name": "קרית מלאכי",
   "city": "קריית מלאכי"
  },
  {
   "code": "987",
   "name": "מגדל העמק",
   "city": "מגדל העמק"
  },
  {
   "code": "988",
   "name": "תל גנים",
   "city": "גבעתיים"
  },
  {
   "code": "989",
   "name": "יחידת בצוע-מחלקת מט\"י",
   "city": "לוד"
  },
  {
   "code": "991",
   "name": "ענף סליקה ומשלוח",
   "city": "לוד"
  },
  {
   "code": "995",
   "name": "פרדיס",
   "city": "פוריידיס"
  },
  {
   "code": "998",
   "name": "פפר",
   "city": "תל אביב -יפו"
  },
  {
   "code": "999",
   "name": "אילת",
   "city": "אילת"
  }
 ],
 "11": [
  {
   "code": "2",
   "name": "מגדל העמק- שלוחת סניף עפולה",
   "city": "מגדל העמק"
  },
  {
   "code": "3",
   "name": "אילת",
   "city": "אילת"
  },
  {
   "code": "4",
   "name": "אשדוד",
   "city": "אשדוד"
  },
  {
   "code": "5",
   "name": "נוף הגליל",
   "city": "נוף הגליל"
  },
  {
   "code": "10",
   "name": "ראשי ת\"א",
   "city": "תל אביב -יפו"
  },
  {
   "code": "14",
   "name": "תל אביב סיטי",
   "city": "תל אביב -יפו"
  },
  {
   "code": "26",
   "name": "חצרות יפו",
   "city": "תל אביב -יפו"
  },
  {
   "code": "34",
   "name": "אלון",
   "city": "תל אביב -יפו"
  },
  {
   "code": "41",
   "name": "פתח תקוה",
   "city": "פתח תקווה"
  },
  {
   "code": "42",
   "name": "כפר יונה -שלוחת נתניה",
   "city": "כפר יונה"
  },
  {
   "code": "43",
   "name": "רמלה",
   "city": "רמלה"
  },
  {
   "code": "44",
   "name": "הרצליה",
   "city": "הרצלייה"
  },
  {
   "code": "45",
   "name": "רחובות",
   "city": "רחובות"
  },
  {
   "code": "46",
   "name": "טבריה",
   "city": "טבריה"
  },
  {
   "code": "49",
   "name": "חולון",
   "city": "חולון"
  },
  {
   "code": "51",
   "name": "שלוחת בת ים",
   "city": "בת ים"
  },
  {
   "code": "54",
   "name": "כפר סבא",
   "city": "כפר סבא"
  },
  {
   "code": "55",
   "name": "ראשון לציון",
   "city": "ראשון לציון"
  },
  {
   "code": "56",
   "name": "כפר גנים",
   "city": "פתח תקווה"
  },
  {
   "code": "58",
   "name": "דרך בן גוריון",
   "city": "בני ברק"
  },
  {
   "code": "59",
   "name": "לוד",
   "city": "לוד"
  },
  {
   "code": "64",
   "name": "גאולה",
   "city": "ירושלים"
  },
  {
   "code": "65",
   "name": "קרית היובל",
   "city": "ירושלים"
  },
  {
   "code": "66",
   "name": "רחביה",
   "city": "ירושלים"
  },
  {
   "code": "68",
   "name": "מזרח ירושלים",
   "city": "ירושלים"
  },
  {
   "code": "69",
   "name": "בית הכרם",
   "city": "ירושלים"
  },
  {
   "code": "75",
   "name": "קרית מוצקין",
   "city": "קריית מוצקין"
  },
  {
   "code": "76",
   "name": "פל ים שלוחת מרכז הכרמל",
   "city": "חיפה"
  },
  {
   "code": "77",
   "name": "קרית אתא",
   "city": "קריית אתא"
  },
  {
   "code": "80",
   "name": "בורסת היהלומים",
   "city": "רמת גן"
  },
  {
   "code": "85",
   "name": "מרכז קופות תל אביב",
   "city": "תל אביב -יפו"
  },
  {
   "code": "90",
   "name": "חדרה",
   "city": "חדרה"
  },
  {
   "code": "92",
   "name": "רעננה",
   "city": "רעננה"
  },
  {
   "code": "93",
   "name": "נצרת",
   "city": "נצרת"
  },
  {
   "code": "94",
   "name": "באר שבע",
   "city": "באר שבע"
  },
  {
   "code": "95",
   "name": "זכרון יעקב",
   "city": "זכרון יעקב"
  },
  {
   "code": "96",
   "name": "מרום נווה",
   "city": "רמת גן"
  },
  {
   "code": "97",
   "name": "נהריה",
   "city": "נהרייה"
  },
  {
   "code": "98",
   "name": "צפת",
   "city": "צפת"
  },
  {
   "code": "99",
   "name": "עכו",
   "city": "עכו"
  },
  {
   "code": "100",
   "name": "שדרות רוטשילד",
   "city": "תל אביב -יפו"
  },
  {
   "code": "103",
   "name": "קריית אילון חולון",
   "city": "חולון"
  },
  {
   "code": "106",
   "name": "בית הקרנות",
   "city": "חיפה"
  },
  {
   "code": "107",
   "name": "רמת אלמוגי",
   "city": "חיפה"
  },
  {
   "code": "109",
   "name": "שלוחת אדומים-סניף רמת אשכול",
   "city": "ירושלים"
  },
  {
   "code": "110",
   "name": "קרית שמונה",
   "city": "קריית שמונה"
  },
  {
   "code": "111",
   "name": "דימונה",
   "city": "דימונה"
  },
  {
   "code": "112",
   "name": "גדרה",
   "city": "גדרה"
  },
  {
   "code": "114",
   "name": "רובע ד'",
   "city": "אשדוד"
  },
  {
   "code": "117",
   "name": "נס ציונה",
   "city": "נס ציונה"
  },
  {
   "code": "118",
   "name": "נוה אביבים",
   "city": "תל אביב -יפו"
  },
  {
   "code": "123",
   "name": "ככר היהלום",
   "city": "רמת גן"
  },
  {
   "code": "125",
   "name": "רמת השרון",
   "city": "רמת השרון"
  },
  {
   "code": "128",
   "name": "ברנע שלוחת אשקלון",
   "city": "אשקלון"
  },
  {
   "code": "129",
   "name": "מרכז מזומנים ראשון לציון",
   "city": "ראשון לציון"
  },
  {
   "code": "130",
   "name": "מאפו",
   "city": "תל אביב -יפו"
  },
  {
   "code": "131",
   "name": "קרית גת",
   "city": "קריית גת"
  },
  {
   "code": "136",
   "name": "קיראון",
   "city": "קריית אונו"
  },
  {
   "code": "139",
   "name": "בני ברק",
   "city": "בני ברק"
  },
  {
   "code": "145",
   "name": "גבעתיים",
   "city": "גבעתיים"
  },
  {
   "code": "146",
   "name": "הרצליה פיתוח",
   "city": "הרצלייה"
  },
  {
   "code": "147",
   "name": "לב דיזנגוף",
   "city": "תל אביב -יפו"
  },
  {
   "code": "148",
   "name": "הנביאים",
   "city": "בת ים"
  },
  {
   "code": "151",
   "name": "יד אליהו",
   "city": "תל אביב -יפו"
  },
  {
   "code": "152",
   "name": "ככר המדינה",
   "city": "תל אביב -יפו"
  },
  {
   "code": "153",
   "name": "קרית מלאכי",
   "city": "קריית מלאכי"
  },
  {
   "code": "156",
   "name": "מלא\"ב-נתניה",
   "city": "נתניה"
  },
  {
   "code": "157",
   "name": "התעשיה חולון",
   "city": "חולון"
  },
  {
   "code": "159",
   "name": "מרכז קופות מחנה יהודה",
   "city": "ירושלים"
  },
  {
   "code": "162",
   "name": "תלפיות ירושלים",
   "city": "ירושלים"
  },
  {
   "code": "167",
   "name": "בית שמש",
   "city": "בית שמש"
  },
  {
   "code": "174",
   "name": "כרמיאל",
   "city": "כרמיאל"
  },
  {
   "code": "175",
   "name": "יבנה",
   "city": "יבנה"
  },
  {
   "code": "176",
   "name": "המפרץ",
   "city": "קריית אתא"
  },
  {
   "code": "187",
   "name": "הוד השרון",
   "city": "הוד השרון"
  },
  {
   "code": "194",
   "name": "שלוחת מרכז כלל",
   "city": "ירושלים"
  },
  {
   "code": "198",
   "name": "אפקה",
   "city": "תל אביב -יפו"
  },
  {
   "code": "219",
   "name": "דיסקונט 360",
   "city": "ראשון לציון"
  },
  {
   "code": "220",
   "name": "טלבנק",
   "city": "קריית אתא"
  },
  {
   "code": "221",
   "name": "טלבנק",
   "city": "ירושלים"
  },
  {
   "code": "222",
   "name": "טלבנק",
   "city": "דימונה"
  },
  {
   "code": "232",
   "name": "המרכז לבנקאות פרטית בינלאומית",
   "city": "תל אביב -יפו"
  },
  {
   "code": "233",
   "name": "המרכז לבנקאות פרטית ירושלים",
   "city": "ירושלים"
  },
  {
   "code": "302",
   "name": "גבעת טל",
   "city": "ראש העין"
  },
  {
   "code": "303",
   "name": "מודיעין",
   "city": "מודיעין-מכבים-רעות*"
  },
  {
   "code": "320",
   "name": "קריית השרון",
   "city": "נתניה"
  },
  {
   "code": "321",
   "name": "הלאום",
   "city": "ירושלים"
  },
  {
   "code": "330",
   "name": "בי\"ח וולפסון",
   "city": "בת ים"
  },
  {
   "code": "340",
   "name": "המרכז לבנקאות פרטית השרון",
   "city": "הרצלייה"
  },
  {
   "code": "348",
   "name": "מרכז מזומנים ירושלים",
   "city": "ירושלים"
  },
  {
   "code": "357",
   "name": "המרכז לבנקאות פרטית תל אביב",
   "city": "תל אביב -יפו"
  },
  {
   "code": "361",
   "name": "פרדס חנה",
   "city": "פרדס חנה-כרכור"
  },
  {
   "code": "362",
   "name": "אם המושבות",
   "city": "פתח תקווה"
  },
  {
   "code": "381",
   "name": "מרכז עסקים ירושלים והדרום",
   "city": "ירושלים"
  },
  {
   "code": "382",
   "name": "מרכז עסקים השרון",
   "city": "הרצלייה"
  },
  {
   "code": "383",
   "name": "מרכז עסקים צפון",
   "city": "קריית ביאליק"
  },
  {
   "code": "384",
   "name": "מרכז עסקים השפלה",
   "city": "רחובות"
  },
  {
   "code": "387",
   "name": "מרכז ייעוץ דיגיטלי",
   "city": "ראשון לציון"
  },
  {
   "code": "396",
   "name": "אסף הרופא",
   "city": "ראשון לציון"
  },
  {
   "code": "398",
   "name": "קרית אור",
   "city": "קריית אונו"
  },
  {
   "code": "443",
   "name": "קרית ביאליק",
   "city": "קריית ביאליק"
  },
  {
   "code": "444",
   "name": "המרכז לבנקאות פרטית-חיפה והצפון",
   "city": "חיפה"
  },
  {
   "code": "452",
   "name": "מרכז עסקים מרכז",
   "city": "תל אביב -יפו"
  },
  {
   "code": "475",
   "name": "מרכז השקעות דן",
   "city": "תל אביב -יפו"
  },
  {
   "code": "476",
   "name": "מרכז השקעות ירושלים והדרום",
   "city": "ירושלים"
  },
  {
   "code": "477",
   "name": "מרכז השקעות שפלה",
   "city": "ראשון לציון"
  },
  {
   "code": "478",
   "name": "מרכז השקעות צפון",
   "city": "קריית ביאליק"
  },
  {
   "code": "479",
   "name": "מרכז השקעות השרון",
   "city": "רמת השרון"
  },
  {
   "code": "495",
   "name": "מרכז השקעות בינלאומי",
   "city": "תל אביב -יפו"
  },
  {
   "code": "506",
   "name": "מערב ראשון לציון",
   "city": "ראשון לציון"
  },
  {
   "code": "510",
   "name": "מבשרת ציון",
   "city": "מבשרת ציון"
  },
  {
   "code": "517",
   "name": "שלוחת באר שבע",
   "city": "באר שבע"
  },
  {
   "code": "518",
   "name": "מחלקת בנקים ומוסדות זרים",
   "city": "תל אביב -יפו"
  },
  {
   "code": "520",
   "name": "מחלקת שירותי מט\"ח ותקשורת בין בנקאית",
   "city": "ראשון לציון"
  },
  {
   "code": "526",
   "name": "פולג נתניה",
   "city": "נתניה"
  },
  {
   "code": "535",
   "name": "סניף טאצ'ר",
   "city": "ראשון לציון"
  },
  {
   "code": "993",
   "name": "שלוחת מרכז כלל",
   "city": "ירושלים"
  }
 ],
 "12": [
  {
   "code": "41",
   "name": "פועלים INVEST עפולה",
   "city": "עפולה"
  },
  {
   "code": "60",
   "name": "אגף משכן",
   "city": "תל אביב -יפו"
  },
  {
   "code": "61",
   "name": "61 מרכז תפעול עסקי",
   "city": "בית דגן"
  },
  {
   "code": "62",
   "name": "פועלים INVEST אשדוד",
   "city": "אשדוד"
  },
  {
   "code": "63",
   "name": "63 מרכז תפעול עסקי",
   "city": "בית דגן"
  },
  {
   "code": "72",
   "name": "72 מרכז תפעול עסקי",
   "city": "בית דגן"
  },
  {
   "code": "79",
   "name": "פועלים PRO נשר - 4",
   "city": "נשר"
  },
  {
   "code": "80",
   "name": "פועלים PRO אזור  - 3",
   "city": "חולון"
  },
  {
   "code": "90",
   "name": "ירכא",
   "city": "ירכא"
  },
  {
   "code": "110",
   "name": "110 מרכז תפעול עסקי",
   "city": "בית דגן"
  },
  {
   "code": "113",
   "name": "פועלים PRO אזור  - 1",
   "city": "חולון"
  },
  {
   "code": "115",
   "name": "פועלים INVEST חדרה",
   "city": "חדרה"
  },
  {
   "code": "139",
   "name": "פועלים INVEST רמת גן",
   "city": "רמת גן"
  },
  {
   "code": "143",
   "name": "פועלים INVEST פתח תקוה",
   "city": "פתח תקווה"
  },
  {
   "code": "144",
   "name": "פועלים INVEST חיפה",
   "city": "חיפה"
  },
  {
   "code": "150",
   "name": "פועלים INVEST הרצליה",
   "city": "הרצלייה"
  },
  {
   "code": "153",
   "name": "כפר גנים",
   "city": "פתח תקווה"
  },
  {
   "code": "159",
   "name": "159 מרכז תפעול עסקי",
   "city": "בית דגן"
  },
  {
   "code": "160",
   "name": "נווה זאב",
   "city": "באר שבע"
  },
  {
   "code": "167",
   "name": "167 מרכז תפעול עסקי",
   "city": "בית דגן"
  },
  {
   "code": "168",
   "name": "168 מרכז תפעול עסקי",
   "city": "בית דגן"
  },
  {
   "code": "169",
   "name": "169 מרכז תפעול עסקי",
   "city": "בית דגן"
  },
  {
   "code": "170",
   "name": "הסניף הראשי",
   "city": "תל אביב -יפו"
  },
  {
   "code": "174",
   "name": "174 מרכז תפעול עסקי",
   "city": "בית דגן"
  },
  {
   "code": "175",
   "name": "175 מרכז תפעול עסקי",
   "city": "בית דגן"
  },
  {
   "code": "176",
   "name": "176 מרכז תפעול עסקי",
   "city": "בית דגן"
  },
  {
   "code": "177",
   "name": "177 מרכז תפעול עסקי",
   "city": "בית דגן"
  },
  {
   "code": "184",
   "name": "מרכז מזומנים",
   "city": "תל אביב -יפו"
  },
  {
   "code": "202",
   "name": "שלוחת כפר יאסיף",
   "city": "כפר יאסיף"
  },
  {
   "code": "211",
   "name": "פועלים Business נצרת",
   "city": "נצרת"
  },
  {
   "code": "215",
   "name": "שלוחת אכסאל",
   "city": "אכסאל"
  },
  {
   "code": "239",
   "name": "כפר מנדא",
   "city": "כפר מנדא"
  },
  {
   "code": "242",
   "name": "פועלים INVEST תל אביב",
   "city": "תל אביב -יפו"
  },
  {
   "code": "244",
   "name": "פועלים PRO נשר - 2",
   "city": "נשר"
  },
  {
   "code": "267",
   "name": "פועלים INVEST קריות",
   "city": "חיפה"
  },
  {
   "code": "282",
   "name": "נכסי קרנות נאמנות",
   "city": "תל אביב -יפו"
  },
  {
   "code": "286",
   "name": "אריאל",
   "city": "אריאל"
  },
  {
   "code": "290",
   "name": "ביתר עילית",
   "city": "ביתר עילית"
  },
  {
   "code": "300",
   "name": "פועלים Business בת ים",
   "city": "בת ים"
  },
  {
   "code": "359",
   "name": "מרכז עסקים המפרץ",
   "city": "חיפה"
  },
  {
   "code": "391",
   "name": "391 מרכז תפעול עסקי",
   "city": "בית דגן"
  },
  {
   "code": "394",
   "name": "394 מרכז תפעול עסקי",
   "city": "בית דגן"
  },
  {
   "code": "399",
   "name": "399 מרכז תפעול עסקי",
   "city": "בית דגן"
  },
  {
   "code": "406",
   "name": "פועלים INVEST ירושלים",
   "city": "ירושלים"
  },
  {
   "code": "407",
   "name": "פועלים Business רעננה",
   "city": "רעננה"
  },
  {
   "code": "408",
   "name": "פועלים INVEST ראשון לציון",
   "city": "ראשון לציון"
  },
  {
   "code": "410",
   "name": "שוהם",
   "city": "שוהם"
  },
  {
   "code": "412",
   "name": "412 מרכז תפעול עסקי",
   "city": "בית דגן"
  },
  {
   "code": "415",
   "name": "פועלים PRO אזור  - 5",
   "city": "חולון"
  },
  {
   "code": "416",
   "name": "פועלים INVEST רחובות",
   "city": "רחובות"
  },
  {
   "code": "417",
   "name": "בנקאות ישירה נשר",
   "city": "נשר"
  },
  {
   "code": "418",
   "name": "טמרה",
   "city": "טמרה"
  },
  {
   "code": "427",
   "name": "בנקאות ישירה חולון",
   "city": "חולון"
  },
  {
   "code": "432",
   "name": "פועלים INVEST נתניה",
   "city": "נתניה"
  },
  {
   "code": "434",
   "name": "פועלים INVEST באר שבע",
   "city": "באר שבע"
  },
  {
   "code": "436",
   "name": "436 מרכז תפעול עסקי",
   "city": "בית דגן"
  },
  {
   "code": "445",
   "name": "מת\"ב בית דגן",
   "city": "בית דגן"
  },
  {
   "code": "446",
   "name": "רמת בית שמש",
   "city": "בית שמש"
  },
  {
   "code": "448",
   "name": "מבשרת ציון",
   "city": "מבשרת ציון"
  },
  {
   "code": "449",
   "name": "יפיע",
   "city": "יפיע"
  },
  {
   "code": "450",
   "name": "מרכז עסקים תל אביב",
   "city": "תל אביב -יפו"
  },
  {
   "code": "452",
   "name": "מרכז עסקים דרום",
   "city": "רחובות"
  },
  {
   "code": "453",
   "name": "מרכז עסקים המרכז",
   "city": "רמת גן"
  },
  {
   "code": "454",
   "name": "מרכז עסקים אשדוד",
   "city": "אשדוד"
  },
  {
   "code": "455",
   "name": "מרכז עסקים השרון",
   "city": "הרצלייה"
  },
  {
   "code": "457",
   "name": "מרכז עסקים ירושלים",
   "city": "ירושלים"
  },
  {
   "code": "458",
   "name": "מרכז עסקים צפון",
   "city": "רמת ישי"
  },
  {
   "code": "459",
   "name": "פועלים Business נתניה",
   "city": "נתניה"
  },
  {
   "code": "465",
   "name": "אם המושבות",
   "city": "פתח תקווה"
  },
  {
   "code": "472",
   "name": "472 מרכז תפעול עסקי",
   "city": "בית דגן"
  },
  {
   "code": "473",
   "name": "חריש",
   "city": "חריש"
  },
  {
   "code": "475",
   "name": "אלעד",
   "city": "אלעד"
  },
  {
   "code": "478",
   "name": "כפר כנא",
   "city": "כפר כנא"
  },
  {
   "code": "479",
   "name": "סכנין",
   "city": "סח'נין"
  },
  {
   "code": "486",
   "name": "רהט",
   "city": "רהט"
  },
  {
   "code": "500",
   "name": "פועלים Business הרימון ת\"א",
   "city": "תל אביב -יפו"
  },
  {
   "code": "506",
   "name": "טירה המשולש",
   "city": "טירה"
  },
  {
   "code": "509",
   "name": "נכסי קופות גמל",
   "city": "תל אביב -יפו"
  },
  {
   "code": "515",
   "name": "בנקאות פלטינום",
   "city": "תל אביב -יפו"
  },
  {
   "code": "516",
   "name": "רמת הנשיא",
   "city": "בת ים"
  },
  {
   "code": "520",
   "name": "פועלים Business גבעת שאול",
   "city": "ירושלים"
  },
  {
   "code": "522",
   "name": "שנקר",
   "city": "חולון"
  },
  {
   "code": "524",
   "name": "שלוחת אזור",
   "city": "אזור"
  },
  {
   "code": "532",
   "name": "שאול המלך",
   "city": "תל אביב -יפו"
  },
  {
   "code": "533",
   "name": "מאה שערים",
   "city": "ירושלים"
  },
  {
   "code": "536",
   "name": "שלוחת מזכרת בתיה",
   "city": "מזכרת בתיה"
  },
  {
   "code": "537",
   "name": "פועלים Business רמת גן",
   "city": "רמת גן"
  },
  {
   "code": "538",
   "name": "רמות",
   "city": "ירושלים"
  },
  {
   "code": "539",
   "name": "לב חולון",
   "city": "חולון"
  },
  {
   "code": "540",
   "name": "ככר הסיטי",
   "city": "אשדוד"
  },
  {
   "code": "542",
   "name": "ראש פינה",
   "city": "ראש פינה"
  },
  {
   "code": "544",
   "name": "הדרים",
   "city": "רחובות"
  },
  {
   "code": "548",
   "name": "אום אל פחם",
   "city": "אום אל-פחם"
  },
  {
   "code": "549",
   "name": "כפר תבור",
   "city": "כפר תבור"
  },
  {
   "code": "550",
   "name": "הגולן",
   "city": "בני יהודה"
  },
  {
   "code": "551",
   "name": "קלנסווה",
   "city": "קלנסווה"
  },
  {
   "code": "552",
   "name": "פועלים Business פתח תקוה",
   "city": "פתח תקווה"
  },
  {
   "code": "555",
   "name": "השקד",
   "city": "ראשון לציון"
  },
  {
   "code": "556",
   "name": "נתיבות",
   "city": "נתיבות"
  },
  {
   "code": "559",
   "name": "הדר טל",
   "city": "כפר סבא"
  },
  {
   "code": "562",
   "name": "562 מרכז תפעול עסקי",
   "city": "בית דגן"
  },
  {
   "code": "568",
   "name": "רמת אביב ג'",
   "city": "תל אביב -יפו"
  },
  {
   "code": "570",
   "name": "עומר",
   "city": "עומר"
  },
  {
   "code": "576",
   "name": "חרוד",
   "city": "נוף הגליל"
  },
  {
   "code": "578",
   "name": "כפר קרע",
   "city": "כפר קרע"
  },
  {
   "code": "579",
   "name": "חברות בנות",
   "city": "תל אביב -יפו"
  },
  {
   "code": "581",
   "name": "מג'אר",
   "city": "מגאר"
  },
  {
   "code": "582",
   "name": "מודיעין",
   "city": "מודיעין-מכבים-רעות*"
  },
  {
   "code": "584",
   "name": "הגלים",
   "city": "הרצלייה"
  },
  {
   "code": "586",
   "name": "586 מרכז תפעול עסקי",
   "city": "בית דגן"
  },
  {
   "code": "595",
   "name": "הלוואות עובדים",
   "city": "תל אביב -יפו"
  },
  {
   "code": "599",
   "name": "הגן הטכנולוגי",
   "city": "ירושלים"
  },
  {
   "code": "600",
   "name": "600 מרכז תפעול עסקי",
   "city": "בית דגן"
  },
  {
   "code": "602",
   "name": "הצפון",
   "city": "תל אביב -יפו"
  },
  {
   "code": "603",
   "name": "יד אליהו",
   "city": "תל אביב -יפו"
  },
  {
   "code": "604",
   "name": "קרית שלום",
   "city": "תל אביב -יפו"
  },
  {
   "code": "607",
   "name": "שכונת התקוה",
   "city": "תל אביב -יפו"
  },
  {
   "code": "609",
   "name": "ככר יצחק רבין",
   "city": "תל אביב -יפו"
  },
  {
   "code": "610",
   "name": "הדר יוסף",
   "city": "תל אביב -יפו"
  },
  {
   "code": "611",
   "name": "יפו",
   "city": "תל אביב -יפו"
  },
  {
   "code": "612",
   "name": "נתניה",
   "city": "נתניה"
  },
  {
   "code": "613",
   "name": "רמת גן",
   "city": "רמת גן"
  },
  {
   "code": "615",
   "name": "רחובות",
   "city": "רחובות"
  },
  {
   "code": "616",
   "name": "פתח תקוה",
   "city": "פתח תקווה"
  },
  {
   "code": "617",
   "name": "יהוד",
   "city": "יהוד-מונוסון"
  },
  {
   "code": "618",
   "name": "רמלה",
   "city": "רמלה"
  },
  {
   "code": "620",
   "name": "חדרה",
   "city": "חדרה"
  },
  {
   "code": "621",
   "name": "בנימינה",
   "city": "בנימינה-גבעת עדה*"
  },
  {
   "code": "622",
   "name": "פרדס חנה",
   "city": "פרדס חנה-כרכור"
  },
  {
   "code": "625",
   "name": "זכרון יעקב",
   "city": "זכרון יעקב"
  },
  {
   "code": "626",
   "name": "הוד השרון",
   "city": "הוד השרון"
  },
  {
   "code": "627",
   "name": "כפר סבא",
   "city": "כפר סבא"
  },
  {
   "code": "628",
   "name": "הרצליה",
   "city": "הרצלייה"
  },
  {
   "code": "630",
   "name": "רמת השרון",
   "city": "רמת השרון"
  },
  {
   "code": "631",
   "name": "פועלים BUSINESS באר שבע",
   "city": "באר שבע"
  },
  {
   "code": "632",
   "name": "דימונה",
   "city": "דימונה"
  },
  {
   "code": "633",
   "name": "אופקים",
   "city": "אופקים"
  },
  {
   "code": "634",
   "name": "ראשון לציון",
   "city": "ראשון לציון"
  },
  {
   "code": "636",
   "name": "נס ציונה",
   "city": "נס ציונה"
  },
  {
   "code": "637",
   "name": "באר יעקב",
   "city": "באר יעקב"
  },
  {
   "code": "638",
   "name": "חולון-ויצמן",
   "city": "חולון"
  },
  {
   "code": "640",
   "name": "גבעתיים",
   "city": "גבעתיים"
  },
  {
   "code": "642",
   "name": "בת ים",
   "city": "בת ים"
  },
  {
   "code": "643",
   "name": "פועלים Business חולון",
   "city": "חולון"
  },
  {
   "code": "644",
   "name": "אילת",
   "city": "אילת"
  },
  {
   "code": "645",
   "name": "קרית גת",
   "city": "קריית גת"
  },
  {
   "code": "646",
   "name": "גדרה",
   "city": "גדרה"
  },
  {
   "code": "647",
   "name": "שלוחת גן יבנה",
   "city": "גן יבנה"
  },
  {
   "code": "648",
   "name": "קרית מלאכי",
   "city": "קריית מלאכי"
  },
  {
   "code": "649",
   "name": "שדרות",
   "city": "שדרות"
  },
  {
   "code": "650",
   "name": "פועלים BUSINESS אשקלון",
   "city": "אשקלון"
  },
  {
   "code": "652",
   "name": "שלוחת אבן יהודה",
   "city": "אבן יהודה"
  },
  {
   "code": "653",
   "name": "קדימה",
   "city": "קדימה-צורן"
  },
  {
   "code": "655",
   "name": "בני ברק",
   "city": "בני ברק"
  },
  {
   "code": "656",
   "name": "קרית אונו",
   "city": "קריית אונו"
  },
  {
   "code": "657",
   "name": "אור יהודה",
   "city": "אור יהודה"
  },
  {
   "code": "658",
   "name": "אשדוד",
   "city": "אשדוד"
  },
  {
   "code": "660",
   "name": "שלוחת קרית עקרון",
   "city": "קריית עקרון"
  },
  {
   "code": "661",
   "name": "רעננה",
   "city": "רעננה"
  },
  {
   "code": "665",
   "name": "טייבה",
   "city": "טייבה"
  },
  {
   "code": "666",
   "name": "באקה אל גרביה",
   "city": "באקה אל-גרביה"
  },
  {
   "code": "668",
   "name": "הנשיאים",
   "city": "באר שבע"
  },
  {
   "code": "671",
   "name": "ירוחם",
   "city": "ירוחם"
  },
  {
   "code": "672",
   "name": "מצפה רמון",
   "city": "מצפה רמון"
  },
  {
   "code": "673",
   "name": "מבוא ים",
   "city": "אור עקיבא"
  },
  {
   "code": "675",
   "name": "כפר יונה",
   "city": "כפר יונה"
  },
  {
   "code": "677",
   "name": "ראש העין",
   "city": "ראש העין"
  },
  {
   "code": "680",
   "name": "כפר שמריהו",
   "city": "כפר שמריהו"
  },
  {
   "code": "681",
   "name": "לב דיזנגוף",
   "city": "תל אביב -יפו"
  },
  {
   "code": "685",
   "name": "לוד",
   "city": "לוד"
  },
  {
   "code": "686",
   "name": "שמשון",
   "city": "אשקלון"
  },
  {
   "code": "690",
   "name": "ירושלים  ראשי",
   "city": "ירושלים"
  },
  {
   "code": "692",
   "name": "בית שמש",
   "city": "בית שמש"
  },
  {
   "code": "694",
   "name": "בית הכרם",
   "city": "ירושלים"
  },
  {
   "code": "695",
   "name": "רמות אשכול",
   "city": "ירושלים"
  },
  {
   "code": "696",
   "name": "מזרח ירושלים",
   "city": "ירושלים"
  },
  {
   "code": "698",
   "name": "שערי העיר",
   "city": "ירושלים"
  },
  {
   "code": "699",
   "name": "פסגת זאב",
   "city": "ירושלים"
  },
  {
   "code": "700",
   "name": "חיפה ראשי",
   "city": "חיפה"
  },
  {
   "code": "701",
   "name": "הר הכרמל",
   "city": "חיפה"
  },
  {
   "code": "702",
   "name": "נוה שאנן",
   "city": "חיפה"
  },
  {
   "code": "703",
   "name": "טירת הכרמל",
   "city": "טירת כרמל"
  },
  {
   "code": "704",
   "name": "אחוזה",
   "city": "חיפה"
  },
  {
   "code": "708",
   "name": "שלוחת כרמלים",
   "city": "חיפה"
  },
  {
   "code": "712",
   "name": "נשר תל חנן",
   "city": "נשר"
  },
  {
   "code": "713",
   "name": "עכו",
   "city": "עכו"
  },
  {
   "code": "714",
   "name": "צפת",
   "city": "צפת"
  },
  {
   "code": "715",
   "name": "חצור",
   "city": "חצור הגלילית"
  },
  {
   "code": "716",
   "name": "נהריה",
   "city": "נהרייה"
  },
  {
   "code": "717",
   "name": "בית שאן",
   "city": "בית שאן"
  },
  {
   "code": "718",
   "name": "קרית שמונה",
   "city": "קריית שמונה"
  },
  {
   "code": "719",
   "name": "קרית טבעון-הנשיא",
   "city": "קריית טבעון"
  },
  {
   "code": "721",
   "name": "קרית אתא",
   "city": "קריית אתא"
  },
  {
   "code": "722",
   "name": "יקנעם",
   "city": "יקנעם עילית"
  },
  {
   "code": "723",
   "name": "טבריה",
   "city": "טבריה"
  },
  {
   "code": "726",
   "name": "נצרת",
   "city": "נצרת"
  },
  {
   "code": "727",
   "name": "עפולה",
   "city": "עפולה"
  },
  {
   "code": "728",
   "name": "מגדל העמק",
   "city": "מגדל העמק"
  },
  {
   "code": "729",
   "name": "קרית מוצקין",
   "city": "קריית מוצקין"
  },
  {
   "code": "731",
   "name": "שפרעם",
   "city": "שפרעם"
  },
  {
   "code": "732",
   "name": "מעלות תרשיחא",
   "city": "מעלות-תרשיחא"
  },
  {
   "code": "736",
   "name": "פועלים Business חיפה",
   "city": "חיפה"
  },
  {
   "code": "738",
   "name": "עפולה עלית",
   "city": "עפולה"
  },
  {
   "code": "742",
   "name": "דלית אל כרמל-עוספיה",
   "city": "דאלית אל-כרמל"
  },
  {
   "code": "743",
   "name": "שרת",
   "city": "קריית ים"
  },
  {
   "code": "744",
   "name": "מג'דל שמס",
   "city": "מג'דל שמס"
  },
  {
   "code": "746",
   "name": "הקריון",
   "city": "קריית ביאליק"
  },
  {
   "code": "747",
   "name": "כרמיאל",
   "city": "כרמיאל"
  },
  {
   "code": "748",
   "name": "תלפיות",
   "city": "ירושלים"
  },
  {
   "code": "749",
   "name": "הים",
   "city": "נתניה"
  },
  {
   "code": "752",
   "name": "התעשיה האוירית",
   "city": "לוד"
  },
  {
   "code": "754",
   "name": "פנקס",
   "city": "תל אביב -יפו"
  },
  {
   "code": "755",
   "name": "שלוחת יזרעאליה",
   "city": "חיפה"
  },
  {
   "code": "762",
   "name": "יבנה",
   "city": "יבנה"
  },
  {
   "code": "763",
   "name": "ערד",
   "city": "ערד"
  },
  {
   "code": "765",
   "name": "765 מרכז תפעול עסקי",
   "city": "בית דגן"
  },
  {
   "code": "766",
   "name": "גור",
   "city": "אשדוד"
  },
  {
   "code": "768",
   "name": "נוה-ים",
   "city": "ראשון לציון"
  },
  {
   "code": "770",
   "name": "האשל",
   "city": "באר שבע"
  },
  {
   "code": "771",
   "name": "עיר ימים",
   "city": "נתניה"
  },
  {
   "code": "772",
   "name": "פועלים Business בגין ת\"א",
   "city": "תל אביב -יפו"
  },
  {
   "code": "773",
   "name": "נוה רם",
   "city": "רמת גן"
  },
  {
   "code": "774",
   "name": "נמל תעופה בן גוריון",
   "city": "לוד"
  },
  {
   "code": "778",
   "name": "אביבים",
   "city": "תל אביב -יפו"
  },
  {
   "code": "780",
   "name": "פועלים Business יצחק שדה",
   "city": "תל אביב -יפו"
  },
  {
   "code": "782",
   "name": "רחביה",
   "city": "ירושלים"
  },
  {
   "code": "784",
   "name": "הגבעה הצרפתית",
   "city": "ירושלים"
  },
  {
   "code": "791",
   "name": "פועלים Business המפרץ",
   "city": "חיפה"
  },
  {
   "code": "794",
   "name": "מרכז תפעולי ארצי לסחר חוץ",
   "city": "תל אביב -יפו"
  },
  {
   "code": "799",
   "name": "הנהלה ראשית",
   "city": "תל אביב -יפו"
  },
  {
   "code": "863",
   "name": "חדרי עסקאות וברוקראג'",
   "city": "תל אביב -יפו"
  },
  {
   "code": "877",
   "name": "פועלים בטלפון",
   "city": "אזור"
  },
  {
   "code": "980",
   "name": "שלוחת קרית עקרון",
   "city": "קריית עקרון"
  },
  {
   "code": "982",
   "name": "שלוחת אכסאל",
   "city": "אכסאל"
  },
  {
   "code": "983",
   "name": "שלוחת אבן יהודה",
   "city": "אבן יהודה"
  },
  {
   "code": "985",
   "name": "שלוחת גן יבנה",
   "city": "גן יבנה"
  },
  {
   "code": "986",
   "name": "שלוחת מזכרת בתיה",
   "city": "מזכרת בתיה"
  },
  {
   "code": "987",
   "name": "שלוחת כרמלים",
   "city": "חיפה"
  },
  {
   "code": "988",
   "name": "שלוחת יזרעאליה",
   "city": "חיפה"
  }
 ],
 "14": [
  {
   "code": "303",
   "name": "אוצר החייל רמות באר שבע",
   "city": "באר שבע"
  },
  {
   "code": "305",
   "name": "סניף וירטואלי ME",
   "city": "רחובות"
  },
  {
   "code": "306",
   "name": "אוצר החייל מרכז עסקים ירושלים",
   "city": "ירושלים"
  },
  {
   "code": "309",
   "name": "עפולה",
   "city": "עפולה"
  },
  {
   "code": "310",
   "name": "חדרה",
   "city": "חדרה"
  },
  {
   "code": "311",
   "name": "פרדס חנה",
   "city": "פרדס חנה-כרכור"
  },
  {
   "code": "313",
   "name": "ראש פינה",
   "city": "ראש פינה"
  },
  {
   "code": "314",
   "name": "גלילות",
   "city": "רמת השרון"
  },
  {
   "code": "315",
   "name": "מודיעין",
   "city": "מודיעין-מכבים-רעות*"
  },
  {
   "code": "316",
   "name": "קריית השרון",
   "city": "נתניה"
  },
  {
   "code": "317",
   "name": "פתח תקוה - כפר-גנים",
   "city": "פתח תקווה"
  },
  {
   "code": "319",
   "name": "נהריה",
   "city": "נהרייה"
  },
  {
   "code": "321",
   "name": "המרכז למימון מתמחה",
   "city": "תל אביב -יפו"
  },
  {
   "code": "322",
   "name": "גבעתיים",
   "city": "תל אביב -יפו"
  },
  {
   "code": "324",
   "name": "טבריה",
   "city": "טבריה"
  },
  {
   "code": "327",
   "name": "מרכז עסקים שרון",
   "city": "הרצלייה"
  },
  {
   "code": "329",
   "name": "יוקנעם",
   "city": "יקנעם עילית"
  },
  {
   "code": "330",
   "name": "רמת גן",
   "city": "רמת גן"
  },
  {
   "code": "331",
   "name": "עובדה",
   "city": "אילת"
  },
  {
   "code": "334",
   "name": "חבר",
   "city": "רמת גן"
  },
  {
   "code": "335",
   "name": "כפר סבא הירוקה אוצה\"ח",
   "city": "כפר סבא"
  },
  {
   "code": "336",
   "name": "חיל הים - חיפה",
   "city": "חיפה"
  },
  {
   "code": "338",
   "name": "לקוחות נבחרים",
   "city": "ראשון לציון"
  },
  {
   "code": "342",
   "name": "נבטים",
   "city": "ערד"
  },
  {
   "code": "343",
   "name": "אריאל",
   "city": "אריאל"
  },
  {
   "code": "344",
   "name": "ראשון לציון",
   "city": "ראשון לציון"
  },
  {
   "code": "345",
   "name": "רעות",
   "city": "מודיעין-מכבים-רעות*"
  },
  {
   "code": "346",
   "name": "נתניה",
   "city": "נתניה"
  },
  {
   "code": "348",
   "name": "אפק",
   "city": "ראש העין"
  },
  {
   "code": "349",
   "name": "אוצה\"ח אשקלון ברנע",
   "city": "אשקלון"
  },
  {
   "code": "350",
   "name": "מת\"מ אומגה",
   "city": "טירת כרמל"
  },
  {
   "code": "355",
   "name": "אשדוד",
   "city": "אשדוד"
  },
  {
   "code": "357",
   "name": "הסניף המרכזי",
   "city": "תל אביב -יפו"
  },
  {
   "code": "359",
   "name": "אוצר החייל קרית גת",
   "city": "קריית גת"
  },
  {
   "code": "360",
   "name": "קרית שמונה אוצר החייל",
   "city": "קריית שמונה"
  },
  {
   "code": "361",
   "name": "החשמונאים",
   "city": "תל אביב -יפו"
  },
  {
   "code": "362",
   "name": "מפרץ חיפה",
   "city": "חיפה"
  },
  {
   "code": "363",
   "name": "באר שבע",
   "city": "באר שבע"
  },
  {
   "code": "365",
   "name": "צהלה",
   "city": "תל אביב -יפו"
  },
  {
   "code": "366",
   "name": "תל נוף",
   "city": "גדרה"
  },
  {
   "code": "367",
   "name": "חצור",
   "city": "חצור-אשדוד"
  },
  {
   "code": "369",
   "name": "ירושלים",
   "city": "ירושלים"
  },
  {
   "code": "372",
   "name": "תל השומר",
   "city": "רמת גן"
  },
  {
   "code": "373",
   "name": "אשקלון אוצר החייל",
   "city": "אשקלון"
  },
  {
   "code": "375",
   "name": "רמת השרון",
   "city": "רמת השרון"
  },
  {
   "code": "376",
   "name": "חצרים",
   "city": "חצרים"
  },
  {
   "code": "377",
   "name": "אילת",
   "city": "אילת"
  },
  {
   "code": "378",
   "name": "הקריה",
   "city": "תל אביב -יפו"
  },
  {
   "code": "379",
   "name": "פלמחים",
   "city": "פלמחים"
  },
  {
   "code": "380",
   "name": "כפר סבא",
   "city": "כפר סבא"
  },
  {
   "code": "381",
   "name": "רמון",
   "city": "הר הנגב הצפוני מ\"א 48"
  },
  {
   "code": "382",
   "name": "בת ים חולון",
   "city": "בת ים"
  },
  {
   "code": "388",
   "name": "מרכז שרות ישיר",
   "city": "ראשון לציון"
  },
  {
   "code": "392",
   "name": "מערב ראשון לציון",
   "city": "ראשון לציון"
  },
  {
   "code": "395",
   "name": "רחובות",
   "city": "רחובות"
  },
  {
   "code": "397",
   "name": "גדרה",
   "city": "גדרה"
  },
  {
   "code": "398",
   "name": "כרמיאל",
   "city": "כרמיאל"
  },
  {
   "code": "399",
   "name": "מטה אוצר החייל",
   "city": "תל אביב -יפו"
  },
  {
   "code": "477",
   "name": "עובדה",
   "city": "אילת"
  },
  {
   "code": "916",
   "name": "המרכז לבנקאות פרטית - צפון",
   "city": "חיפה"
  }
 ],
 "17": [
  {
   "code": "602",
   "name": "ירכא",
   "city": "ירכא"
  },
  {
   "code": "603",
   "name": "מיתר",
   "city": "מיתר"
  },
  {
   "code": "606",
   "name": "מחלקת עסקאות חוץ",
   "city": "ראשון לציון"
  },
  {
   "code": "607",
   "name": "מרכז מומחים-חולון",
   "city": "ראשון לציון"
  },
  {
   "code": "613",
   "name": "משכנתאות",
   "city": "ראשון לציון"
  },
  {
   "code": "614",
   "name": "טמרה",
   "city": "טמרה"
  },
  {
   "code": "619",
   "name": "אגף החשבות",
   "city": "ראשון לציון"
  },
  {
   "code": "620",
   "name": "שפרעם",
   "city": "שפרעם"
  },
  {
   "code": "621",
   "name": "שבטי ישראל",
   "city": "ירושלים"
  },
  {
   "code": "623",
   "name": "דבוריה",
   "city": "דבורייה"
  },
  {
   "code": "624",
   "name": "מג'ד אל כרום",
   "city": "מג'ד אל-כרום"
  },
  {
   "code": "625",
   "name": "מעיליא",
   "city": "מעיליא"
  },
  {
   "code": "626",
   "name": "עראבה",
   "city": "עראבה"
  },
  {
   "code": "627",
   "name": "פאולוס השישי",
   "city": "נצרת"
  },
  {
   "code": "628",
   "name": "יפיע",
   "city": "יפיע"
  },
  {
   "code": "630",
   "name": "ריינה",
   "city": "ריינה"
  },
  {
   "code": "631",
   "name": "כפר כנא",
   "city": "כפר כנא"
  },
  {
   "code": "632",
   "name": "טורעאן",
   "city": "טורעאן"
  },
  {
   "code": "634",
   "name": "עילבון",
   "city": "עיילבון"
  },
  {
   "code": "635",
   "name": "גאולה",
   "city": "ירושלים"
  },
  {
   "code": "638",
   "name": "סאלח א-דין",
   "city": "ירושלים"
  },
  {
   "code": "639",
   "name": "נצרת ראשי",
   "city": "נצרת"
  },
  {
   "code": "640",
   "name": "אל ראם",
   "city": "נצרת"
  },
  {
   "code": "642",
   "name": "ירושלים ראשי",
   "city": "ירושלים"
  },
  {
   "code": "643",
   "name": "ראמה",
   "city": "ראמה"
  },
  {
   "code": "644",
   "name": "עכו",
   "city": "עכו"
  },
  {
   "code": "645",
   "name": "באר שבע",
   "city": "באר שבע"
  },
  {
   "code": "647",
   "name": "נתניה",
   "city": "נתניה"
  },
  {
   "code": "649",
   "name": "דימונה",
   "city": "דימונה"
  },
  {
   "code": "650",
   "name": "מרכז עסקים אזור חיפה",
   "city": "נשר"
  },
  {
   "code": "651",
   "name": "פתח תקוה",
   "city": "פתח תקווה"
  },
  {
   "code": "653",
   "name": "יפו",
   "city": "תל אביב -יפו"
  },
  {
   "code": "654",
   "name": "ראשי תל אביב",
   "city": "תל אביב -יפו"
  },
  {
   "code": "659",
   "name": "חשבות הבנק",
   "city": "ראשון לציון"
  },
  {
   "code": "660",
   "name": "נהריה",
   "city": "נהרייה"
  },
  {
   "code": "661",
   "name": "כנפי נשרים",
   "city": "ירושלים"
  },
  {
   "code": "662",
   "name": "טירת הכרמל",
   "city": "תל אביב -יפו"
  },
  {
   "code": "663",
   "name": "רמת גן",
   "city": "רמת גן"
  },
  {
   "code": "668",
   "name": "ראשון לציון",
   "city": "ראשון לציון"
  },
  {
   "code": "669",
   "name": "רמלה",
   "city": "רמלה"
  },
  {
   "code": "671",
   "name": "אכסאל",
   "city": "אכסאל"
  },
  {
   "code": "672",
   "name": "השלום",
   "city": "תל אביב -יפו"
  },
  {
   "code": "674",
   "name": "רחובות",
   "city": "רחובות"
  },
  {
   "code": "676",
   "name": "אשדוד",
   "city": "אשדוד"
  },
  {
   "code": "677",
   "name": "חדרה",
   "city": "חדרה"
  },
  {
   "code": "678",
   "name": "בת ים",
   "city": "בת ים"
  },
  {
   "code": "679",
   "name": "מרכז הכרמל",
   "city": "חיפה"
  },
  {
   "code": "680",
   "name": "קרית מוצקין",
   "city": "קריית מוצקין"
  },
  {
   "code": "681",
   "name": "ג'דידה מכר",
   "city": "ג'דיידה-מכר"
  },
  {
   "code": "683",
   "name": "אור יהודה",
   "city": "אור יהודה"
  },
  {
   "code": "686",
   "name": "חולון",
   "city": "חולון"
  },
  {
   "code": "687",
   "name": "סכנין",
   "city": "סח'נין"
  },
  {
   "code": "690",
   "name": "מרכז ני\"ע",
   "city": "ראשון לציון"
  },
  {
   "code": "691",
   "name": "כפר יאסיף",
   "city": "כפר יאסיף"
  },
  {
   "code": "692",
   "name": "תרשיחא",
   "city": "מעלות-תרשיחא"
  },
  {
   "code": "694",
   "name": "ואדי ניסנאס",
   "city": "חיפה"
  },
  {
   "code": "695",
   "name": "התבור",
   "city": "כפר תבור"
  },
  {
   "code": "696",
   "name": "רהט",
   "city": "רהט"
  },
  {
   "code": "697",
   "name": "אום אל פחם",
   "city": "אום אל-פחם"
  },
  {
   "code": "699",
   "name": "כפר סבא",
   "city": "כפר סבא"
  },
  {
   "code": "701",
   "name": "מנהלת אזור תל אביב והמרכז",
   "city": "חולון"
  },
  {
   "code": "702",
   "name": "מנהלת אזור ירושלים והדרום",
   "city": "ירושלים"
  },
  {
   "code": "703",
   "name": "מנהלת אזור חיפה והשרון",
   "city": "נשר"
  },
  {
   "code": "705",
   "name": "מנהלת אזור נצרת",
   "city": "נצרת"
  },
  {
   "code": "706",
   "name": "מנהלת אזור עכו",
   "city": "כרמיאל"
  },
  {
   "code": "707",
   "name": "מרכז השקעות חיפה",
   "city": "נשר"
  },
  {
   "code": "711",
   "name": "מרכז השקעות ירושלים",
   "city": "ירושלים"
  },
  {
   "code": "712",
   "name": "מרכז השקעות עכו",
   "city": "עכו"
  },
  {
   "code": "714",
   "name": "מרכז השקעות תל אביב",
   "city": "חולון"
  },
  {
   "code": "715",
   "name": "מחלקת פקדונות",
   "city": "ראשון לציון"
  },
  {
   "code": "720",
   "name": "עסקים ראשי",
   "city": "תל אביב -יפו"
  },
  {
   "code": "721",
   "name": "נתיבות",
   "city": "נתיבות"
  },
  {
   "code": "724",
   "name": "בועיינה נג'ידאת",
   "city": "בועיינה-נוג'ידאת"
  },
  {
   "code": "725",
   "name": "בית שמש",
   "city": "בית שמש"
  },
  {
   "code": "727",
   "name": "סחר חוץ - שלוחת נשר",
   "city": "נשר"
  },
  {
   "code": "728",
   "name": "סחר חוץ - שלוחה מרכזית",
   "city": "ראשון לציון"
  },
  {
   "code": "731",
   "name": "רמת בית שמש ד'",
   "city": "בית שמש"
  },
  {
   "code": "732",
   "name": "בני ברק",
   "city": "בני ברק"
  },
  {
   "code": "734",
   "name": "ביתר עילית",
   "city": "ביתר עילית"
  },
  {
   "code": "738",
   "name": "כאבול",
   "city": "כאבול"
  },
  {
   "code": "740",
   "name": "יהודה הנשיא",
   "city": "אשדוד"
  },
  {
   "code": "742",
   "name": "רמות",
   "city": "ירושלים"
  },
  {
   "code": "743",
   "name": "דיר אל אסד-בענה",
   "city": "דייר אל-אסד"
  },
  {
   "code": "744",
   "name": "דיר-חנא",
   "city": "דייר חנא"
  },
  {
   "code": "745",
   "name": "רבי עקיבא",
   "city": "בני ברק"
  },
  {
   "code": "746",
   "name": "רוממה",
   "city": "ירושלים"
  },
  {
   "code": "747",
   "name": "מרכז השקעות נצרת",
   "city": "נצרת"
  },
  {
   "code": "750",
   "name": "כפר קאסם",
   "city": "כפר קאסם"
  },
  {
   "code": "752",
   "name": "העמקים",
   "city": "זרזיר"
  },
  {
   "code": "753",
   "name": "חורפיש",
   "city": "חורפיש"
  },
  {
   "code": "754",
   "name": "רשויות מקומיות",
   "city": "תל אביב -יפו"
  },
  {
   "code": "756",
   "name": "אעבלין",
   "city": "אעבלין"
  },
  {
   "code": "808",
   "name": "מרכז מומחים-מטבע חוץ",
   "city": "ראשון לציון"
  },
  {
   "code": "835",
   "name": "יחידת ביצוע וריכוזים",
   "city": "חולון"
  },
  {
   "code": "847",
   "name": "מחלקת גיבוי-עסקאות חוץ",
   "city": "ראשון לציון"
  },
  {
   "code": "875",
   "name": "מרכז מומחים נשר",
   "city": "נשר"
  },
  {
   "code": "876",
   "name": "מרכז מומחים ירושלים",
   "city": "ירושלים"
  },
  {
   "code": "904",
   "name": "צוות חיתום ופקטורינג",
   "city": "ראשון לציון"
  }
 ],
 "18": [
  {
   "code": "1",
   "name": "לקוחות",
   "city": "תל אביב -יפו"
  },
  {
   "code": "50",
   "name": "תאגידים",
   "city": "תל אביב -יפו"
  },
  {
   "code": "300",
   "name": "ניהול נכסים והתחייבויות",
   "city": "תל אביב -יפו"
  },
  {
   "code": "400",
   "name": "הנהלה",
   "city": "תל אביב -יפו"
  },
  {
   "code": "410",
   "name": "תשלומים לספקים",
   "city": "תל אביב -יפו"
  }
 ],
 "20": [
  {
   "code": "401",
   "name": "קרית העסקים ירושלים",
   "city": "ירושלים"
  },
  {
   "code": "402",
   "name": "מרכז עסקים  י-ם",
   "city": "ירושלים"
  },
  {
   "code": "403",
   "name": "מרכז עסקים י-ם",
   "city": "ירושלים"
  },
  {
   "code": "405",
   "name": "ככר המדינה",
   "city": "תל אביב -יפו"
  },
  {
   "code": "406",
   "name": "חצרות יפו",
   "city": "תל אביב -יפו"
  },
  {
   "code": "407",
   "name": "מ.עסקים חשמונאים",
   "city": "תל אביב -יפו"
  },
  {
   "code": "408",
   "name": "סקיי טאוור",
   "city": "תל אביב -יפו"
  },
  {
   "code": "409",
   "name": "מרכז עסקים ת\"א",
   "city": "תל אביב -יפו"
  },
  {
   "code": "410",
   "name": "כיכר המדינה",
   "city": "תל אביב -יפו"
  },
  {
   "code": "411",
   "name": "קרית אילון",
   "city": "חולון"
  },
  {
   "code": "412",
   "name": "חולון",
   "city": "חולון"
  },
  {
   "code": "413",
   "name": "רמת גן",
   "city": "רמת גן"
  },
  {
   "code": "414",
   "name": "בר אילן",
   "city": "גבעת שמואל"
  },
  {
   "code": "415",
   "name": "הרצליה",
   "city": "הרצלייה"
  },
  {
   "code": "416",
   "name": "אשדוד",
   "city": "אשדוד"
  },
  {
   "code": "417",
   "name": "מלכי ישראל",
   "city": "ירושלים"
  },
  {
   "code": "418",
   "name": "קרית שדה התעופה",
   "city": "נמל תעופה בן-גוריון"
  },
  {
   "code": "419",
   "name": "פארק עסקים חולון",
   "city": "חולון"
  },
  {
   "code": "420",
   "name": "חדרה",
   "city": "חדרה"
  },
  {
   "code": "421",
   "name": "גן העיר",
   "city": "תל אביב -יפו"
  },
  {
   "code": "422",
   "name": "מרכז עסקים נתניה",
   "city": "נתניה"
  },
  {
   "code": "423",
   "name": "מרכז עסקים  רעננה",
   "city": "רעננה"
  },
  {
   "code": "424",
   "name": "אזור תעשיה כפר סבא",
   "city": "כפר סבא"
  },
  {
   "code": "425",
   "name": "בת ים",
   "city": "בת ים"
  },
  {
   "code": "426",
   "name": "מרכז עסקים באר שבע",
   "city": "באר שבע"
  },
  {
   "code": "427",
   "name": "אשקלון",
   "city": "אשקלון"
  },
  {
   "code": "428",
   "name": "נתיבות",
   "city": "נתיבות"
  },
  {
   "code": "429",
   "name": "מרכז עסקים פ\"ת",
   "city": "פתח תקווה"
  },
  {
   "code": "430",
   "name": "מרכז עסקים בני ברק",
   "city": "בני ברק"
  },
  {
   "code": "431",
   "name": "גלובל טאוורס",
   "city": "פתח תקווה"
  },
  {
   "code": "432",
   "name": "רמלה",
   "city": "רמלה"
  },
  {
   "code": "433",
   "name": "קרית גת",
   "city": "קריית גת"
  },
  {
   "code": "434",
   "name": "רחובות",
   "city": "רחובות"
  },
  {
   "code": "435",
   "name": "ראשון לציון",
   "city": "ראשון לציון"
  },
  {
   "code": "436",
   "name": "חצרות יפו",
   "city": "תל אביב -יפו"
  },
  {
   "code": "437",
   "name": "אופקים",
   "city": "אופקים"
  },
  {
   "code": "438",
   "name": "קניון אורות",
   "city": "אור עקיבא"
  },
  {
   "code": "439",
   "name": "בית שאן",
   "city": "בית שאן"
  },
  {
   "code": "440",
   "name": "סקטור תפעול מט\"ח",
   "city": "רמת גן"
  },
  {
   "code": "441",
   "name": "חיפה הדר",
   "city": "חיפה"
  },
  {
   "code": "442",
   "name": "שלומי",
   "city": "שלומי"
  },
  {
   "code": "443",
   "name": "נהריה",
   "city": "נהרייה"
  },
  {
   "code": "444",
   "name": "מרכז עסקים חיפה",
   "city": "חיפה"
  },
  {
   "code": "445",
   "name": "עכו",
   "city": "עכו"
  },
  {
   "code": "446",
   "name": "קרית ים",
   "city": "קריית ים"
  },
  {
   "code": "447",
   "name": "נשר",
   "city": "נשר"
  },
  {
   "code": "448",
   "name": "קרית אתא",
   "city": "קריית אתא"
  },
  {
   "code": "449",
   "name": "כרמל",
   "city": "חיפה"
  },
  {
   "code": "450",
   "name": "קרית מלאכי",
   "city": "קריית מלאכי"
  },
  {
   "code": "451",
   "name": "הלואות ארציות",
   "city": "לוד"
  },
  {
   "code": "452",
   "name": "קניון השרון",
   "city": "נתניה"
  },
  {
   "code": "453",
   "name": "לב דיזנגוף",
   "city": "תל אביב -יפו"
  },
  {
   "code": "454",
   "name": "אפרת",
   "city": "אפרת"
  },
  {
   "code": "455",
   "name": "גבעתיים",
   "city": "גבעתיים"
  },
  {
   "code": "456",
   "name": "דימונה",
   "city": "דימונה"
  },
  {
   "code": "457",
   "name": "האפוטרופוס הכללי",
   "city": "ירושלים"
  },
  {
   "code": "458",
   "name": "גבעת שאול",
   "city": "ירושלים"
  },
  {
   "code": "459",
   "name": "עיר העתיקה",
   "city": "ירושלים"
  },
  {
   "code": "460",
   "name": "עיר העתיקה",
   "city": "ירושלים"
  },
  {
   "code": "461",
   "name": "מרכז עסקים ראשי ת\"א",
   "city": "תל אביב -יפו"
  },
  {
   "code": "462",
   "name": "טבריה",
   "city": "טבריה"
  },
  {
   "code": "463",
   "name": "כפר קאסם",
   "city": "כפר קאסם"
  },
  {
   "code": "464",
   "name": "קק\"ל",
   "city": "באר שבע"
  },
  {
   "code": "465",
   "name": "לב העיר פתח תקווה",
   "city": "פתח תקווה"
  },
  {
   "code": "466",
   "name": "מרכז עסקים יהלומים",
   "city": "רמת גן"
  },
  {
   "code": "467",
   "name": "קרית אונו",
   "city": "קריית אונו"
  },
  {
   "code": "468",
   "name": "חזון איש",
   "city": "בני ברק"
  },
  {
   "code": "469",
   "name": "אלנבי",
   "city": "תל אביב -יפו"
  },
  {
   "code": "470",
   "name": "אילת",
   "city": "אילת"
  },
  {
   "code": "471",
   "name": "סקיי טאוור",
   "city": "תל אביב -יפו"
  },
  {
   "code": "472",
   "name": "רמת השרון",
   "city": "רמת השרון"
  },
  {
   "code": "473",
   "name": "פרדס חנה",
   "city": "פרדס חנה-כרכור"
  },
  {
   "code": "474",
   "name": "עפולה",
   "city": "עפולה"
  },
  {
   "code": "475",
   "name": "מרכז עסקים ת\"א",
   "city": "תל אביב -יפו"
  },
  {
   "code": "476",
   "name": "מרכז עסקים בני ברק",
   "city": "בני ברק"
  },
  {
   "code": "477",
   "name": "המגדל",
   "city": "רמת גן"
  },
  {
   "code": "478",
   "name": "מרכז בנקאות פרטית בינלאומית  ת\"א",
   "city": "תל אביב -יפו"
  },
  {
   "code": "479",
   "name": "שערי צדק",
   "city": "ירושלים"
  },
  {
   "code": "480",
   "name": "ניירות ערך",
   "city": "רמת גן"
  },
  {
   "code": "481",
   "name": "כיכר כפר גנים",
   "city": "פתח תקווה"
  },
  {
   "code": "483",
   "name": "קרני שומרון",
   "city": "קרני שומרון"
  },
  {
   "code": "484",
   "name": "שדרות",
   "city": "שדרות"
  },
  {
   "code": "487",
   "name": "קרית שמונה",
   "city": "קריית שמונה"
  },
  {
   "code": "488",
   "name": "סקטור קופ\"ג",
   "city": "לוד"
  },
  {
   "code": "489",
   "name": "ערד",
   "city": "ערד"
  },
  {
   "code": "490",
   "name": "ברנע אשקלון",
   "city": "אשקלון"
  },
  {
   "code": "491",
   "name": "אשקלון",
   "city": "אשקלון"
  },
  {
   "code": "492",
   "name": "נווה שאנן",
   "city": "חיפה"
  },
  {
   "code": "493",
   "name": "רמת אביב",
   "city": "תל אביב -יפו"
  },
  {
   "code": "494",
   "name": "מ. עסקים חשמונאים",
   "city": "תל אביב -יפו"
  },
  {
   "code": "495",
   "name": "א\"ת ראשל\"צ",
   "city": "ראשון לציון"
  },
  {
   "code": "496",
   "name": "מרכז עסקיםרעננה",
   "city": "רעננה"
  },
  {
   "code": "497",
   "name": "קרני שומרון",
   "city": "קרני שומרון"
  },
  {
   "code": "499",
   "name": "משרד ראשי",
   "city": "לוד"
  },
  {
   "code": "501",
   "name": "סקטור מימון וסחר בינלאומי",
   "city": "לוד"
  },
  {
   "code": "502",
   "name": "מרכז בנקאות פרטית  בינלאומית אשדוד",
   "city": "אשדוד"
  },
  {
   "code": "503",
   "name": "פקטורינג",
   "city": "לוד"
  },
  {
   "code": "505",
   "name": "מת\"מ חיפה",
   "city": "טירת כרמל"
  },
  {
   "code": "509",
   "name": "מרכז הבנקאות",
   "city": "לוד"
  },
  {
   "code": "510",
   "name": "מרכז מזומנים",
   "city": "לוד"
  },
  {
   "code": "511",
   "name": "נס ציונה",
   "city": "נס ציונה"
  },
  {
   "code": "512",
   "name": "הוד השרון",
   "city": "הוד השרון"
  },
  {
   "code": "513",
   "name": "כרמיאל",
   "city": "כרמיאל"
  },
  {
   "code": "514",
   "name": "יהוד",
   "city": "יהוד-מונוסון"
  },
  {
   "code": "515",
   "name": "מגדלי קונקורד",
   "city": "בני ברק"
  },
  {
   "code": "517",
   "name": "תלפיות",
   "city": "ירושלים"
  },
  {
   "code": "518",
   "name": "קריון",
   "city": "קריית ביאליק"
  },
  {
   "code": "519",
   "name": "קרית אריה",
   "city": "פתח תקווה"
  },
  {
   "code": "520",
   "name": "מרכז בנקאות פרטית בינלאומית י-ם",
   "city": "ירושלים"
  },
  {
   "code": "521",
   "name": "מודיעין",
   "city": "מודיעין-מכבים-רעות*"
  },
  {
   "code": "522",
   "name": "הרצליה פיתוח",
   "city": "הרצלייה"
  },
  {
   "code": "523",
   "name": "נשר",
   "city": "נשר"
  },
  {
   "code": "524",
   "name": "ככר המדינה",
   "city": "תל אביב -יפו"
  },
  {
   "code": "525",
   "name": "סביונים",
   "city": "יהוד-מונוסון"
  },
  {
   "code": "526",
   "name": "ערים",
   "city": "כפר סבא"
  },
  {
   "code": "527",
   "name": "קריית איילון",
   "city": "חולון"
  },
  {
   "code": "528",
   "name": "קרית עתידים",
   "city": "תל אביב -יפו"
  },
  {
   "code": "529",
   "name": "קניון הבאר",
   "city": "ראשון לציון"
  },
  {
   "code": "530",
   "name": "גבעת שמואל",
   "city": "גבעת שמואל"
  },
  {
   "code": "531",
   "name": "תפעול קופ\"ג עורפי",
   "city": "לוד"
  },
  {
   "code": "532",
   "name": "פארק המדע רחובות",
   "city": "רחובות"
  },
  {
   "code": "533",
   "name": "אזור תעשיה כפר סבא",
   "city": "כפר סבא"
  },
  {
   "code": "534",
   "name": "מרום נווה",
   "city": "רמת גן"
  },
  {
   "code": "536",
   "name": "תפעול עורפי",
   "city": "לוד"
  },
  {
   "code": "537",
   "name": "אום אל פחם",
   "city": "אום אל-פחם"
  },
  {
   "code": "538",
   "name": "כפר יאסיף",
   "city": "כפר יאסיף"
  },
  {
   "code": "539",
   "name": "כנפי נשרים",
   "city": "ירושלים"
  },
  {
   "code": "540",
   "name": "יבנה",
   "city": "יבנה"
  },
  {
   "code": "541",
   "name": "מרכז בנקאות פרטת נתניה",
   "city": "נתניה"
  },
  {
   "code": "542",
   "name": "מרכז עסקים נתניה",
   "city": "נתניה"
  },
  {
   "code": "543",
   "name": "ראש העין",
   "city": "ראש העין"
  },
  {
   "code": "544",
   "name": "קק\"ל",
   "city": "באר שבע"
  },
  {
   "code": "546",
   "name": "מט\"ל לוד",
   "city": "לוד"
  },
  {
   "code": "547",
   "name": "רמת אביב",
   "city": "תל אביב -יפו"
  },
  {
   "code": "548",
   "name": "כיכר כפר גנים",
   "city": "פתח תקווה"
  },
  {
   "code": "549",
   "name": "באקה אל גרביה",
   "city": "באקה אל-גרביה"
  },
  {
   "code": "550",
   "name": "לב העיר פתח תקווה",
   "city": "פתח תקווה"
  },
  {
   "code": "551",
   "name": "מידטאון ת\"א",
   "city": "תל אביב -יפו"
  },
  {
   "code": "552",
   "name": "מגדל  העמק",
   "city": "מגדל העמק"
  },
  {
   "code": "553",
   "name": "קניון השרון",
   "city": "נתניה"
  },
  {
   "code": "554",
   "name": "פארק הים",
   "city": "בת ים"
  },
  {
   "code": "555",
   "name": "קוגל חולון",
   "city": "חולון"
  },
  {
   "code": "556",
   "name": "מרכז עסקים חשמונאים",
   "city": "תל אביב -יפו"
  },
  {
   "code": "557",
   "name": "יגאל אלון",
   "city": "תל אביב -יפו"
  },
  {
   "code": "558",
   "name": "מעלות",
   "city": "מעלות-תרשיחא"
  },
  {
   "code": "559",
   "name": "נצרת",
   "city": "נצרת"
  },
  {
   "code": "560",
   "name": "נוף הגליל(נ.עלית)",
   "city": "נוף הגליל"
  },
  {
   "code": "561",
   "name": "אחוזה מערב",
   "city": "רעננה"
  },
  {
   "code": "562",
   "name": "צפת",
   "city": "צפת"
  },
  {
   "code": "563",
   "name": "רמות ירושלים",
   "city": "ירושלים"
  },
  {
   "code": "564",
   "name": "מרכז עסקים חיפה",
   "city": "חיפה"
  },
  {
   "code": "565",
   "name": "אשדוד סיטי",
   "city": "אשדוד"
  },
  {
   "code": "566",
   "name": "מצדה",
   "city": "באר שבע"
  },
  {
   "code": "567",
   "name": "בית שמש",
   "city": "בית שמש"
  },
  {
   "code": "568",
   "name": "מרכז עסקים י-ם",
   "city": "ירושלים"
  },
  {
   "code": "569",
   "name": "רמת אשכול  י-ם",
   "city": "ירושלים"
  },
  {
   "code": "570",
   "name": "רימונים",
   "city": "בני ברק"
  },
  {
   "code": "571",
   "name": "עתיד",
   "city": "לוד"
  },
  {
   "code": "572",
   "name": "אופק",
   "city": "לוד"
  },
  {
   "code": "573",
   "name": "שחק",
   "city": "לוד"
  },
  {
   "code": "574",
   "name": "שגב",
   "city": "לוד"
  },
  {
   "code": "576",
   "name": "ברק",
   "city": "לוד"
  },
  {
   "code": "577",
   "name": "שביט",
   "city": "לוד"
  },
  {
   "code": "580",
   "name": "בטוח לאומי ושרות תעסוקה",
   "city": "רמת גן"
  },
  {
   "code": "581",
   "name": "שפרעם",
   "city": "שפרעם"
  },
  {
   "code": "582",
   "name": "יוקנעם",
   "city": "יקנעם עילית"
  },
  {
   "code": "583",
   "name": "ב\"ב רח' ירושלים",
   "city": "בני ברק"
  },
  {
   "code": "585",
   "name": "סחנין",
   "city": "סח'נין"
  },
  {
   "code": "589",
   "name": "כפר קאסם",
   "city": "כפר קאסם"
  },
  {
   "code": "590",
   "name": "זיכרון יעקב",
   "city": "זכרון יעקב"
  },
  {
   "code": "591",
   "name": "אגריפס ירושלים",
   "city": "ירושלים"
  },
  {
   "code": "592",
   "name": "אור יהודה",
   "city": "אור יהודה"
  },
  {
   "code": "593",
   "name": "חריש",
   "city": "חריש"
  },
  {
   "code": "594",
   "name": "שמאי",
   "city": "ירושלים"
  },
  {
   "code": "596",
   "name": "פיקדונות מוסדיים",
   "city": "רמת גן"
  },
  {
   "code": "597",
   "name": "חסכון פנסיוני",
   "city": "לוד"
  },
  {
   "code": "600",
   "name": "קרן חסויים",
   "city": "ירושלים"
  },
  {
   "code": "604",
   "name": "הפניקס  8  קופ\"ג",
   "city": "גבעתיים"
  },
  {
   "code": "612",
   "name": "תפעול קופ\"ג עורפי 2",
   "city": "לוד"
  },
  {
   "code": "614",
   "name": "עו\"ז ב",
   "city": "נמל תעופה בן-גוריון"
  },
  {
   "code": "615",
   "name": "א.ת.אשדוד",
   "city": "אשדוד"
  },
  {
   "code": "616",
   "name": "אינפינטי קופ\"ג",
   "city": "הרצלייה"
  },
  {
   "code": "617",
   "name": "פרימיום",
   "city": "לוד"
  },
  {
   "code": "618",
   "name": "עו\"ז",
   "city": "נמל תעופה בן-גוריון"
  },
  {
   "code": "619",
   "name": "הפניקס 10 קופ\"ג",
   "city": "גבעתיים"
  },
  {
   "code": "620",
   "name": "הפניקס קופ\"ג",
   "city": "גבעתיים"
  },
  {
   "code": "621",
   "name": "אנלייסט קופ\"ג",
   "city": "תל אביב -יפו"
  },
  {
   "code": "622",
   "name": "ד\"ש קופ\"ג",
   "city": "בני ברק"
  },
  {
   "code": "623",
   "name": "אקסלנס הלמן ישן 1",
   "city": "גבעתיים"
  },
  {
   "code": "624",
   "name": "הפניקס קופ\"ג",
   "city": "גבעתיים"
  },
  {
   "code": "626",
   "name": "ד\"ש 2 קופ\"ג",
   "city": "בני ברק"
  },
  {
   "code": "627",
   "name": "אלטשולר קופ\"ג",
   "city": "תל אביב -יפו"
  },
  {
   "code": "628",
   "name": "אקסלנס הלמן ישן 2",
   "city": "גבעתיים"
  },
  {
   "code": "629",
   "name": "הפניקס 2 קופ\"ג",
   "city": "גבעתיים"
  },
  {
   "code": "630",
   "name": "הפניקס 3 קופ\"ג",
   "city": "גבעתיים"
  },
  {
   "code": "631",
   "name": "ד\"ש 3 קופ\"ג",
   "city": "בני ברק"
  },
  {
   "code": "632",
   "name": "אקסלנס הלמן ישן 3",
   "city": "גבעתיים"
  },
  {
   "code": "633",
   "name": "איילון (קופ\"ג)",
   "city": "רמת גן"
  },
  {
   "code": "634",
   "name": "אקסלנס הלמן ישן 4",
   "city": "גבעתיים"
  },
  {
   "code": "635",
   "name": "הפניקס 4 קופ\"ג",
   "city": "גבעתיים"
  },
  {
   "code": "636",
   "name": "הפניקס 5 קופ\"ג",
   "city": "גבעתיים"
  },
  {
   "code": "637",
   "name": "הפניקס 6 קופ\"ג",
   "city": "גבעתיים"
  },
  {
   "code": "638",
   "name": "ד\"ש 4 קופ\"ג",
   "city": "בני ברק"
  },
  {
   "code": "639",
   "name": "יהב כספונים",
   "city": "תל אביב -יפו"
  },
  {
   "code": "640",
   "name": "ד\"ש6 קופ\"ג",
   "city": "בני ברק"
  },
  {
   "code": "641",
   "name": "ד\"ש 7 קופ\"ג",
   "city": "בני ברק"
  },
  {
   "code": "642",
   "name": "ד\"ש 8  קופ\"ג",
   "city": "בני ברק"
  },
  {
   "code": "643",
   "name": "ד\"ש 9  קופ\"ג",
   "city": "בני ברק"
  },
  {
   "code": "644",
   "name": "ד\"ש 10 קופ\"ג",
   "city": "בני ברק"
  },
  {
   "code": "645",
   "name": "ד\"ש11 קופ\"ג",
   "city": "בני ברק"
  },
  {
   "code": "646",
   "name": "ד\"ש12 קופ\"ג",
   "city": "בני ברק"
  },
  {
   "code": "647",
   "name": "כפר סבא  רח' ויצמן",
   "city": "כפר סבא"
  },
  {
   "code": "648",
   "name": "אקסלנס הלמן ישן 5",
   "city": "גבעתיים"
  },
  {
   "code": "649",
   "name": "הפניקס7   קופ\"ג",
   "city": "גבעתיים"
  },
  {
   "code": "652",
   "name": "איילון 2 (קופ\"ג)",
   "city": "רמת גן"
  },
  {
   "code": "653",
   "name": "מיטב ד\"ש 13 קופ\"ג",
   "city": "בני ברק"
  },
  {
   "code": "654",
   "name": "מיטב ד\"ש 14 קופ\"ג",
   "city": "בני ברק"
  },
  {
   "code": "655",
   "name": "הפניקס 9 קופ\"ג",
   "city": "גבעתיים"
  },
  {
   "code": "657",
   "name": "מרכז ערים רחובות",
   "city": "רחובות"
  },
  {
   "code": "658",
   "name": "ד\"ש 5 קופ\"ג",
   "city": "בני ברק"
  },
  {
   "code": "660",
   "name": "אקסלנס הלמן ישן 6",
   "city": "גבעתיים"
  },
  {
   "code": "664",
   "name": "מיטב ד\"ש 16 קופ\"ג",
   "city": "בני ברק"
  },
  {
   "code": "665",
   "name": "מיטב ד\"ש 15 קופ\"ג",
   "city": "בני ברק"
  },
  {
   "code": "667",
   "name": "פרימיום",
   "city": "תל אביב -יפו"
  },
  {
   "code": "669",
   "name": "קניון השרון",
   "city": "נתניה"
  },
  {
   "code": "670",
   "name": "קופ\"ג חב' חשמל",
   "city": "תל אביב -יפו"
  },
  {
   "code": "671",
   "name": "מרכז עסקים ת\"א",
   "city": "תל אביב -יפו"
  },
  {
   "code": "673",
   "name": "חסכון לכל ילד",
   "city": "לוד"
  },
  {
   "code": "674",
   "name": "אקסלנס הלמן ישן 7",
   "city": "גבעתיים"
  },
  {
   "code": "688",
   "name": "מסלקה",
   "city": "לוד"
  },
  {
   "code": "689",
   "name": "ביצוע",
   "city": "לוד"
  },
  {
   "code": "708",
   "name": "אשראי צרכני",
   "city": "לוד"
  },
  {
   "code": "709",
   "name": "אשראי צרכני ב'",
   "city": "לוד"
  },
  {
   "code": "722",
   "name": "מודיעין עלית",
   "city": "מודיעין עילית"
  },
  {
   "code": "723",
   "name": "אלנבי",
   "city": "תל אביב -יפו"
  },
  {
   "code": "724",
   "name": "אשראי צרכני ג'",
   "city": "לוד"
  },
  {
   "code": "726",
   "name": "אלעד",
   "city": "אלעד"
  },
  {
   "code": "727",
   "name": "מיקדו",
   "city": "תל אביב -יפו"
  },
  {
   "code": "728",
   "name": "פארק אפק ראש העין",
   "city": "ראש העין"
  },
  {
   "code": "729",
   "name": "רוממה",
   "city": "ירושלים"
  },
  {
   "code": "730",
   "name": "כיכר המושבה",
   "city": "הוד השרון"
  },
  {
   "code": "731",
   "name": "אחוזה מערב",
   "city": "רעננה"
  },
  {
   "code": "732",
   "name": "שטמפפר נתניה",
   "city": "נתניה"
  },
  {
   "code": "733",
   "name": "קרית מוצקין",
   "city": "קריית מוצקין"
  },
  {
   "code": "734",
   "name": "רמת בית שמש",
   "city": "בית שמש"
  },
  {
   "code": "737",
   "name": "משכנתא מהבית",
   "city": "ירושלים"
  },
  {
   "code": "751",
   "name": "הלואות ארציות",
   "city": "לוד"
  },
  {
   "code": "781",
   "name": "שוברי אשראי",
   "city": "רמת גן"
  },
  {
   "code": "786",
   "name": "עו\"ז ג",
   "city": "נמל תעופה בן-גוריון"
  },
  {
   "code": "787",
   "name": "עו\"ז ד",
   "city": "נמל תעופה בן-גוריון"
  },
  {
   "code": "904",
   "name": "חב' אינפינטי",
   "city": "הרצלייה"
  },
  {
   "code": "905",
   "name": "מיטב דש חל\"י",
   "city": "בני ברק"
  },
  {
   "code": "906",
   "name": "הפניקס חל\"י",
   "city": "גבעתיים"
  },
  {
   "code": "907",
   "name": "אקסלנס הלמן ישן 8",
   "city": "גבעתיים"
  },
  {
   "code": "908",
   "name": "מחוג חברת חשמל",
   "city": "תל אביב -יפו"
  },
  {
   "code": "909",
   "name": "שיבולת",
   "city": "בארות יצחק"
  },
  {
   "code": "910",
   "name": "מיטב  דש קופ\"ג",
   "city": "בני ברק"
  },
  {
   "code": "911",
   "name": "הפניקס קופ\"ג",
   "city": "גבעתיים"
  },
  {
   "code": "912",
   "name": "מיטב דש גמל ופנסיה",
   "city": "בני ברק"
  },
  {
   "code": "913",
   "name": "הפניקס קופ\"ג",
   "city": "גבעתיים"
  },
  {
   "code": "914",
   "name": "מיטב דש גמל ופנסיה",
   "city": "בני ברק"
  },
  {
   "code": "915",
   "name": "מיטב דש גמל ופנסיה",
   "city": "בני ברק"
  },
  {
   "code": "917",
   "name": "מיטב דש גמל ופנסיה",
   "city": "בני ברק"
  },
  {
   "code": "918",
   "name": "מיטב דש גמל ופנסיה",
   "city": "בני ברק"
  },
  {
   "code": "919",
   "name": "הפניקס קופ\"ג",
   "city": "גבעתיים"
  },
  {
   "code": "920",
   "name": "הפניקס קופ\"ג",
   "city": "גבעתיים"
  },
  {
   "code": "921",
   "name": "אינפינטי קופ\"ג",
   "city": "הרצלייה"
  },
  {
   "code": "922",
   "name": "מיטב דש גמל ופנסיה",
   "city": "בני ברק"
  },
  {
   "code": "923",
   "name": "מיטב דש גמל ופנסיה",
   "city": "בני ברק"
  },
  {
   "code": "924",
   "name": "מיטב דש גמל ופנסיה",
   "city": "בני ברק"
  },
  {
   "code": "925",
   "name": "הפניקס קופ\"ג",
   "city": "גבעתיים"
  },
  {
   "code": "926",
   "name": "הפניקס קופ\"ג",
   "city": "גבעתיים"
  },
  {
   "code": "927",
   "name": "הפניקס קופ\"ג",
   "city": "גבעתיים"
  },
  {
   "code": "928",
   "name": "אינפינטי קופ\"ג",
   "city": "הרצלייה"
  },
  {
   "code": "929",
   "name": "אינפינטי קופ\"ג",
   "city": "הרצלייה"
  },
  {
   "code": "930",
   "name": "אינפינטי קופ\"ג",
   "city": "הרצלייה"
  },
  {
   "code": "931",
   "name": "אינפינטי קופ\"ג",
   "city": "הרצלייה"
  },
  {
   "code": "932",
   "name": "מיטב דש גמל ופנסיה",
   "city": "בני ברק"
  },
  {
   "code": "933",
   "name": "מיטב דש גמל ופנסיה",
   "city": "בני ברק"
  },
  {
   "code": "934",
   "name": "הפניקס קופ\"ג",
   "city": "גבעתיים"
  },
  {
   "code": "935",
   "name": "הפניקס קופ\"ג",
   "city": "גבעתיים"
  },
  {
   "code": "936",
   "name": "מיטב דש גמל ופנסיה",
   "city": "בני ברק"
  },
  {
   "code": "937",
   "name": "מיטב דש גמל ופנסיה",
   "city": "בני ברק"
  }
 ],
 "22": [
  {
   "code": "1",
   "name": "ראשי",
   "city": "תל אביב -יפו"
  },
  {
   "code": "2",
   "name": "פנימי",
   "city": "תל אביב -יפו"
  }
 ],
 "23": [
  {
   "code": "101",
   "name": "אייצ' אס בי סי בנק",
   "city": "רמת גן"
  },
  {
   "code": "102",
   "name": "אייצ' אס בי סי בנק",
   "city": "רמת גן"
  }
 ],
 "26": [
  {
   "code": "262",
   "name": "רחביה",
   "city": "ירושלים"
  },
  {
   "code": "264",
   "name": "יובנק מרכז עסקים י-ם",
   "city": "ירושלים"
  },
  {
   "code": "272",
   "name": "ככר המדינה",
   "city": "תל אביב -יפו"
  },
  {
   "code": "273",
   "name": "יובנק - שד' רוטשילד תל אביב",
   "city": "תל אביב -יפו"
  },
  {
   "code": "274",
   "name": "יובנק - הרצליה",
   "city": "הרצלייה"
  },
  {
   "code": "279",
   "name": "יובנק - רחובות",
   "city": "רחובות"
  },
  {
   "code": "280",
   "name": "יובנק - רעננה",
   "city": "רעננה"
  },
  {
   "code": "286",
   "name": "יובנק - ניירות ערך",
   "city": "תל אביב -יפו"
  },
  {
   "code": "287",
   "name": "יובנק - תל אביב (ראשי)",
   "city": "תל אביב -יפו"
  },
  {
   "code": "288",
   "name": "יובנק - ירושלים",
   "city": "ירושלים"
  }
 ],
 "31": [
  {
   "code": "1",
   "name": "ראש פינה",
   "city": "ראש פינה"
  },
  {
   "code": "2",
   "name": "טבריה",
   "city": "טבריה"
  },
  {
   "code": "3",
   "name": "אילת",
   "city": "אילת"
  },
  {
   "code": "6",
   "name": "עסקים ראשי צפון",
   "city": "חיפה"
  },
  {
   "code": "7",
   "name": "נווה שאנן",
   "city": "חיפה"
  },
  {
   "code": "8",
   "name": "קרית ביאליק",
   "city": "קריית ביאליק"
  },
  {
   "code": "9",
   "name": "הכרמל חיפה",
   "city": "חיפה"
  },
  {
   "code": "12",
   "name": "ירושלים ראשי",
   "city": "ירושלים"
  },
  {
   "code": "13",
   "name": "רחביה",
   "city": "ירושלים"
  },
  {
   "code": "17",
   "name": "באר שבע",
   "city": "באר שבע"
  },
  {
   "code": "19",
   "name": "רמות באר שבע",
   "city": "באר שבע"
  },
  {
   "code": "21",
   "name": "כפר סבא",
   "city": "כפר סבא"
  },
  {
   "code": "22",
   "name": "נתניה",
   "city": "נתניה"
  },
  {
   "code": "24",
   "name": "קריית השרון",
   "city": "נתניה"
  },
  {
   "code": "26",
   "name": "הבורסה",
   "city": "רמת גן"
  },
  {
   "code": "27",
   "name": "חדרה",
   "city": "חדרה"
  },
  {
   "code": "28",
   "name": "גבעתיים",
   "city": "גבעתיים"
  },
  {
   "code": "29",
   "name": "רחובות",
   "city": "רחובות"
  },
  {
   "code": "32",
   "name": "ראשון לציון",
   "city": "ראשון לציון"
  },
  {
   "code": "33",
   "name": "אשדוד סיטי",
   "city": "אשדוד"
  },
  {
   "code": "34",
   "name": "שלוחת פתח תקוה",
   "city": "פתח תקווה"
  },
  {
   "code": "35",
   "name": "קיראון",
   "city": "קריית אונו"
  },
  {
   "code": "36",
   "name": "אפק",
   "city": "ראש העין"
  },
  {
   "code": "37",
   "name": "הוד השרון",
   "city": "הוד השרון"
  },
  {
   "code": "38",
   "name": "סביון",
   "city": "סביון*"
  },
  {
   "code": "39",
   "name": "בת ים",
   "city": "בת ים"
  },
  {
   "code": "41",
   "name": "רמת גן",
   "city": "רמת גן"
  },
  {
   "code": "44",
   "name": "האופרה",
   "city": "תל אביב -יפו"
  },
  {
   "code": "46",
   "name": "תל אביב ראשי",
   "city": "תל אביב -יפו"
  },
  {
   "code": "48",
   "name": "עסקים מרכז",
   "city": "תל אביב -יפו"
  },
  {
   "code": "50",
   "name": "קרית שמונה",
   "city": "קריית שמונה"
  },
  {
   "code": "51",
   "name": "הרצליה פתוח",
   "city": "הרצלייה"
  },
  {
   "code": "52",
   "name": "נהריה",
   "city": "נהרייה"
  },
  {
   "code": "59",
   "name": "כרמיאל",
   "city": "כרמיאל"
  },
  {
   "code": "60",
   "name": "יחידת ביצוע ני\"ע",
   "city": "ראשון לציון"
  },
  {
   "code": "62",
   "name": "קרית גת",
   "city": "קריית גת"
  },
  {
   "code": "64",
   "name": "צמרות",
   "city": "הרצלייה"
  },
  {
   "code": "65",
   "name": "דיזנגוף",
   "city": "תל אביב -יפו"
  },
  {
   "code": "78",
   "name": "חולון עסקים",
   "city": "חולון"
  },
  {
   "code": "82",
   "name": "רמת אביב",
   "city": "תל אביב -יפו"
  },
  {
   "code": "85",
   "name": "רמת השרון הבינלאומי",
   "city": "רמת השרון"
  },
  {
   "code": "88",
   "name": "מתחם קופות ומזומנים",
   "city": "אשדוד"
  },
  {
   "code": "91",
   "name": "מעלות",
   "city": "מעלות-תרשיחא"
  },
  {
   "code": "92",
   "name": "רעננה",
   "city": "רעננה"
  },
  {
   "code": "93",
   "name": "ככר המדינה",
   "city": "תל אביב -יפו"
  },
  {
   "code": "94",
   "name": "טופ-דן",
   "city": "תל אביב -יפו"
  },
  {
   "code": "95",
   "name": "כפר גנים",
   "city": "פתח תקווה"
  },
  {
   "code": "105",
   "name": "סניף וירטואלי ME",
   "city": "רחובות"
  },
  {
   "code": "109",
   "name": "אשקלון",
   "city": "אשקלון"
  },
  {
   "code": "111",
   "name": "עפולה",
   "city": "עפולה"
  },
  {
   "code": "112",
   "name": "דניה",
   "city": "חיפה"
  },
  {
   "code": "114",
   "name": "קרית משה",
   "city": "ירושלים"
  },
  {
   "code": "116",
   "name": "רוטשילד",
   "city": "תל אביב -יפו"
  },
  {
   "code": "118",
   "name": "רמלוד",
   "city": "רמלה"
  },
  {
   "code": "119",
   "name": "ראשל\"צ מערב",
   "city": "ראשון לציון"
  },
  {
   "code": "120",
   "name": "כפר ורדים",
   "city": "כפר ורדים"
  },
  {
   "code": "124",
   "name": "אם המושבות",
   "city": "פתח תקווה"
  },
  {
   "code": "126",
   "name": "אבני חן",
   "city": "רמת גן"
  },
  {
   "code": "127",
   "name": "אביבים",
   "city": "תל אביב -יפו"
  },
  {
   "code": "128",
   "name": "מודיעין",
   "city": "מודיעין-מכבים-רעות*"
  },
  {
   "code": "131",
   "name": "יוקנעם",
   "city": "יקנעם עילית"
  },
  {
   "code": "132",
   "name": "אשקלון ברנע רב מותגי",
   "city": "אשקלון"
  },
  {
   "code": "134",
   "name": "קריית אילון",
   "city": "חולון"
  },
  {
   "code": "135",
   "name": "כפר סבא הירוקה",
   "city": "כפר סבא"
  },
  {
   "code": "138",
   "name": "הטכניון",
   "city": "חיפה"
  },
  {
   "code": "139",
   "name": "מרכז עסקים י-ם",
   "city": "ירושלים"
  },
  {
   "code": "140",
   "name": "מרכז עסקים שרון",
   "city": "הרצלייה"
  },
  {
   "code": "150",
   "name": "מרכז תפעול לחברי בורסה שאינם בנקים",
   "city": "ראשון לציון"
  },
  {
   "code": "160",
   "name": "מתחם שירותי קופות",
   "city": "בני ברק"
  },
  {
   "code": "172",
   "name": "פאגי שלוחת רמות",
   "city": "ירושלים"
  },
  {
   "code": "173",
   "name": "פאגי נתיבות",
   "city": "נתיבות"
  },
  {
   "code": "174",
   "name": "פאגי רחובות",
   "city": "רחובות"
  },
  {
   "code": "175",
   "name": "פאגי רב שפע",
   "city": "ירושלים"
  },
  {
   "code": "176",
   "name": "פאגי אלעד",
   "city": "אלעד"
  },
  {
   "code": "177",
   "name": "פאגי ביתר עילית",
   "city": "ביתר עילית"
  },
  {
   "code": "179",
   "name": "פאגי רמת בית שמש",
   "city": "בית שמש"
  },
  {
   "code": "180",
   "name": "פאגי מודיעין עילית",
   "city": "מודיעין עילית"
  },
  {
   "code": "181",
   "name": "פאגי פתח תקוה",
   "city": "פתח תקווה"
  },
  {
   "code": "182",
   "name": "פאגי כנפי נשרים",
   "city": "ירושלים"
  },
  {
   "code": "183",
   "name": "פאגי רבי עקיבא",
   "city": "בני ברק"
  },
  {
   "code": "185",
   "name": "פאגי ירושלים",
   "city": "ירושלים"
  },
  {
   "code": "186",
   "name": "פאגי אשדוד",
   "city": "אשדוד"
  },
  {
   "code": "187",
   "name": "פאגי חיפה",
   "city": "חיפה"
  },
  {
   "code": "188",
   "name": "פאגי בני ברק",
   "city": "בני ברק"
  },
  {
   "code": "189",
   "name": "פאגי תל אביב",
   "city": "תל אביב -יפו"
  },
  {
   "code": "203",
   "name": "מתחם שירותי קופה - תל אביב",
   "city": "תל אביב -יפו"
  },
  {
   "code": "204",
   "name": "מתחם שירותי קופה - חיפה והקריות",
   "city": "חיפה"
  },
  {
   "code": "205",
   "name": "מתחם שירותי קופה - ירושלים",
   "city": "ירושלים"
  },
  {
   "code": "215",
   "name": "פקדונות במערכת סגורה",
   "city": "אשדוד"
  },
  {
   "code": "222",
   "name": "מרכז תפעול סניפי",
   "city": "אשדוד"
  },
  {
   "code": "262",
   "name": "רחביה",
   "city": "ירושלים"
  },
  {
   "code": "264",
   "name": "יובנק מרכז עסקים י-ם",
   "city": "ירושלים"
  },
  {
   "code": "272",
   "name": "ככר המדינה",
   "city": "תל אביב -יפו"
  },
  {
   "code": "273",
   "name": "יובנק - שד' רוטשילד תל אביב",
   "city": "תל אביב -יפו"
  },
  {
   "code": "274",
   "name": "יובנק - הרצליה",
   "city": "הרצלייה"
  },
  {
   "code": "279",
   "name": "יובנק - רחובות",
   "city": "רחובות"
  },
  {
   "code": "280",
   "name": "יובנק - רעננה",
   "city": "רעננה"
  },
  {
   "code": "286",
   "name": "יובנק - ניירות ערך",
   "city": "תל אביב -יפו"
  },
  {
   "code": "287",
   "name": "יובנק - תל אביב (ראשי)",
   "city": "תל אביב -יפו"
  },
  {
   "code": "288",
   "name": "יובנק - ירושלים",
   "city": "ירושלים"
  },
  {
   "code": "295",
   "name": "בינלאומי קול",
   "city": "ראשון לציון"
  },
  {
   "code": "296",
   "name": "קופות גמל",
   "city": "תל אביב -יפו"
  },
  {
   "code": "297",
   "name": "יחידה מרכזת",
   "city": "ראשון לציון"
  },
  {
   "code": "298",
   "name": "הנהלת חשבונות ראשית",
   "city": "תל אביב -יפו"
  },
  {
   "code": "303",
   "name": "אוצר החייל רמות באר שבע",
   "city": "באר שבע"
  },
  {
   "code": "305",
   "name": "סניף וירטואלי ME",
   "city": "רחובות"
  },
  {
   "code": "306",
   "name": "אוצר החייל מרכז עסקים י-ם",
   "city": "ירושלים"
  },
  {
   "code": "309",
   "name": "עפולה",
   "city": "עפולה"
  },
  {
   "code": "310",
   "name": "חדרה",
   "city": "חדרה"
  },
  {
   "code": "311",
   "name": "פרדס חנה",
   "city": "פרדס חנה-כרכור"
  },
  {
   "code": "313",
   "name": "ראש פינה",
   "city": "ראש פינה"
  },
  {
   "code": "314",
   "name": "גלילות",
   "city": "רמת השרון"
  },
  {
   "code": "315",
   "name": "מודיעין",
   "city": "מודיעין-מכבים-רעות*"
  },
  {
   "code": "316",
   "name": "קריית השרון",
   "city": "נתניה"
  },
  {
   "code": "317",
   "name": "פתח תקוה - כפר-גנים",
   "city": "פתח תקווה"
  },
  {
   "code": "319",
   "name": "נהריה",
   "city": "נהרייה"
  },
  {
   "code": "321",
   "name": "המרכז למימון מתמחה",
   "city": "תל אביב -יפו"
  },
  {
   "code": "322",
   "name": "גבעתיים",
   "city": "תל אביב -יפו"
  },
  {
   "code": "324",
   "name": "טבריה",
   "city": "טבריה"
  },
  {
   "code": "327",
   "name": "אוצר החייל מרכז עסקים שרון",
   "city": "הרצלייה"
  },
  {
   "code": "329",
   "name": "יוקנעם",
   "city": "יקנעם עילית"
  },
  {
   "code": "330",
   "name": "רמת גן",
   "city": "רמת גן"
  },
  {
   "code": "331",
   "name": "עובדה",
   "city": "אילת"
  },
  {
   "code": "334",
   "name": "חבר",
   "city": "רמת גן"
  },
  {
   "code": "335",
   "name": "כפר סבא הירוקה אוצה\"ח",
   "city": "כפר סבא"
  },
  {
   "code": "336",
   "name": "חיל הים - חיפה",
   "city": "חיפה"
  },
  {
   "code": "338",
   "name": "לקוחות נבחרים",
   "city": "ראשון לציון"
  },
  {
   "code": "342",
   "name": "נבטים",
   "city": "ערד"
  },
  {
   "code": "343",
   "name": "אריאל",
   "city": "אריאל"
  },
  {
   "code": "344",
   "name": "ראשון לציון",
   "city": "ראשון לציון"
  },
  {
   "code": "345",
   "name": "רעות",
   "city": "מודיעין-מכבים-רעות*"
  },
  {
   "code": "346",
   "name": "נתניה",
   "city": "נתניה"
  },
  {
   "code": "348",
   "name": "אפק",
   "city": "ראש העין"
  },
  {
   "code": "349",
   "name": "אוצה\"ח אשקלון ברנע",
   "city": "אשקלון"
  },
  {
   "code": "350",
   "name": "מת\"מ אומגה",
   "city": "טירת כרמל"
  },
  {
   "code": "355",
   "name": "אשדוד",
   "city": "אשדוד"
  },
  {
   "code": "357",
   "name": "הסניף המרכזי",
   "city": "תל אביב -יפו"
  },
  {
   "code": "359",
   "name": "אוצר החייל קרית גת",
   "city": "קריית גת"
  },
  {
   "code": "360",
   "name": "קרית שמונה אוצר החייל",
   "city": "קריית שמונה"
  },
  {
   "code": "361",
   "name": "החשמונאים",
   "city": "תל אביב -יפו"
  },
  {
   "code": "362",
   "name": "מפרץ חיפה",
   "city": "חיפה"
  },
  {
   "code": "363",
   "name": "באר שבע",
   "city": "באר שבע"
  },
  {
   "code": "365",
   "name": "צהלה",
   "city": "תל אביב -יפו"
  },
  {
   "code": "366",
   "name": "תל נוף",
   "city": "גדרה"
  },
  {
   "code": "367",
   "name": "חצור",
   "city": "חצור-אשדוד"
  },
  {
   "code": "369",
   "name": "ירושלים",
   "city": "ירושלים"
  },
  {
   "code": "372",
   "name": "תל השומר",
   "city": "רמת גן"
  },
  {
   "code": "373",
   "name": "אשקלון אוצר החייל",
   "city": "אשקלון"
  },
  {
   "code": "375",
   "name": "רמת השרון",
   "city": "רמת השרון"
  },
  {
   "code": "376",
   "name": "חצרים",
   "city": "חצרים"
  },
  {
   "code": "377",
   "name": "אילת",
   "city": "אילת"
  },
  {
   "code": "378",
   "name": "הקריה",
   "city": "תל אביב -יפו"
  },
  {
   "code": "379",
   "name": "פלמחים",
   "city": "פלמחים"
  },
  {
   "code": "380",
   "name": "כפר סבא",
   "city": "כפר סבא"
  },
  {
   "code": "381",
   "name": "רמון",
   "city": "הר הנגב הצפוני מ\"א 48"
  },
  {
   "code": "382",
   "name": "בת ים חולון",
   "city": "בת ים"
  },
  {
   "code": "388",
   "name": "מרכז שרות ישיר",
   "city": "ראשון לציון"
  },
  {
   "code": "392",
   "name": "מערב ראשון לציון",
   "city": "ראשון לציון"
  },
  {
   "code": "395",
   "name": "רחובות",
   "city": "רחובות"
  },
  {
   "code": "397",
   "name": "גדרה",
   "city": "גדרה"
  },
  {
   "code": "398",
   "name": "כרמיאל",
   "city": "כרמיאל"
  },
  {
   "code": "399",
   "name": "מטה אוצר החייל",
   "city": "תל אביב -יפו"
  },
  {
   "code": "477",
   "name": "עובדה",
   "city": "אילת"
  },
  {
   "code": "916",
   "name": "המרכז לבנקאות פרטית - צפון",
   "city": "חיפה"
  }
 ],
 "39": [
  {
   "code": "1",
   "name": "SBI State Bank of India",
   "city": "רמת גן"
  }
 ],
 "46": [
  {
   "code": "501",
   "name": "ראשון לציון",
   "city": "ראשון לציון"
  },
  {
   "code": "502",
   "name": "כפר סבא",
   "city": "כפר סבא"
  },
  {
   "code": "503",
   "name": "תל אביב",
   "city": "גבעתיים"
  },
  {
   "code": "504",
   "name": "כרמיאל",
   "city": "כרמיאל"
  },
  {
   "code": "506",
   "name": "שפרעם",
   "city": "שפרעם"
  },
  {
   "code": "507",
   "name": "רמת גן",
   "city": "גבעתיים"
  },
  {
   "code": "508",
   "name": "נתניה",
   "city": "נתניה"
  },
  {
   "code": "509",
   "name": "פתח תקוה",
   "city": "פתח תקווה"
  },
  {
   "code": "510",
   "name": "שלוחת עכו",
   "city": "עכו"
  },
  {
   "code": "511",
   "name": "חולון",
   "city": "חולון"
  },
  {
   "code": "514",
   "name": "נצרת",
   "city": "נצרת"
  },
  {
   "code": "515",
   "name": "ירושלים",
   "city": "ירושלים"
  },
  {
   "code": "516",
   "name": "אשדוד",
   "city": "אשדוד"
  },
  {
   "code": "517",
   "name": "חדרה",
   "city": "חדרה"
  },
  {
   "code": "519",
   "name": "שלוחת מודיעין",
   "city": "מודיעין-מכבים-רעות*"
  },
  {
   "code": "520",
   "name": "אום אל פחם",
   "city": "אום אל-פחם"
  },
  {
   "code": "525",
   "name": "פקדונות במערכת סגורה",
   "city": "אשדוד"
  },
  {
   "code": "527",
   "name": "חיפה",
   "city": "חיפה"
  },
  {
   "code": "539",
   "name": "באר שבע",
   "city": "באר שבע"
  },
  {
   "code": "548",
   "name": "הנהלה ראשית",
   "city": "רמת גן"
  },
  {
   "code": "902",
   "name": "שלוחת השרון",
   "city": "כוכב יאיר"
  },
  {
   "code": "904",
   "name": "שלוחת סכנין - סניף כרמיאל",
   "city": "סח'נין"
  },
  {
   "code": "915",
   "name": "שלוחת הגבעה הצרפתית",
   "city": "ירושלים"
  }
 ],
 "50": [
  {
   "code": "1",
   "name": "משרד ראשי",
   "city": "תל אביב -יפו"
  }
 ],
 "52": [
  {
   "code": "160",
   "name": "מתחם שירותי קופות",
   "city": "בני ברק"
  },
  {
   "code": "172",
   "name": "פאגי שלוחת רמות",
   "city": "ירושלים"
  },
  {
   "code": "173",
   "name": "פאגי נתיבות",
   "city": "נתיבות"
  },
  {
   "code": "174",
   "name": "פאגי רחובות",
   "city": "רחובות"
  },
  {
   "code": "175",
   "name": "פאגי רב שפע",
   "city": "ירושלים"
  },
  {
   "code": "176",
   "name": "פאגי אלעד",
   "city": "אלעד"
  },
  {
   "code": "177",
   "name": "פאגי ביתר עילית",
   "city": "ביתר עילית"
  },
  {
   "code": "179",
   "name": "פאגי רמת בית שמש",
   "city": "בית שמש"
  },
  {
   "code": "180",
   "name": "פאגי מודיעין עילית",
   "city": "מודיעין עילית"
  },
  {
   "code": "181",
   "name": "פאגי פתח תקוה",
   "city": "פתח תקווה"
  },
  {
   "code": "182",
   "name": "פאגי כנפי נשרים",
   "city": "ירושלים"
  },
  {
   "code": "183",
   "name": "פאגי רבי עקיבא",
   "city": "בני ברק"
  },
  {
   "code": "185",
   "name": "פאגי ירושלים",
   "city": "ירושלים"
  },
  {
   "code": "186",
   "name": "פאגי אשדוד",
   "city": "אשדוד"
  },
  {
   "code": "187",
   "name": "פאגי חיפה",
   "city": "חיפה"
  },
  {
   "code": "188",
   "name": "פאגי בני ברק",
   "city": "בני ברק"
  },
  {
   "code": "189",
   "name": "פאגי תל אביב",
   "city": "תל אביב -יפו"
  },
  {
   "code": "986",
   "name": "פאגי לב הרובע",
   "city": "אשדוד"
  }
 ],
 "54": [
  {
   "code": "1",
   "name": "משרד ראשי",
   "city": "לוד"
  },
  {
   "code": "8",
   "name": "תפעול בנקאי",
   "city": "לוד"
  },
  {
   "code": "22",
   "name": "פריפייד מנפיק",
   "city": "לוד"
  },
  {
   "code": "25",
   "name": "נתיבות",
   "city": "נתיבות"
  },
  {
   "code": "26",
   "name": "גאולה-רוממה",
   "city": "ירושלים"
  },
  {
   "code": "30",
   "name": "בנקאות פרטית",
   "city": "ירושלים"
  },
  {
   "code": "31",
   "name": "האגף העסקי",
   "city": "לוד"
  },
  {
   "code": "36",
   "name": "מודיעין עילית",
   "city": "מודיעין עילית"
  },
  {
   "code": "40",
   "name": "בית שמש",
   "city": "בית שמש"
  },
  {
   "code": "41",
   "name": "ביתר עילית",
   "city": "ביתר עילית"
  },
  {
   "code": "50",
   "name": "ירושלים ראשי",
   "city": "ירושלים"
  },
  {
   "code": "51",
   "name": "תל אביב",
   "city": "תל אביב -יפו"
  },
  {
   "code": "52",
   "name": "חיפה",
   "city": "חיפה"
  },
  {
   "code": "53",
   "name": "ראשון לציון",
   "city": "ראשון לציון"
  },
  {
   "code": "55",
   "name": "המרכז",
   "city": "בני ברק"
  },
  {
   "code": "61",
   "name": "אשדוד",
   "city": "חצור-אשדוד"
  },
  {
   "code": "63",
   "name": "קריון",
   "city": "קריית ביאליק"
  },
  {
   "code": "69",
   "name": "באר שבע",
   "city": "באר שבע"
  },
  {
   "code": "76",
   "name": "אלעד",
   "city": "אלעד"
  },
  {
   "code": "77",
   "name": "סניף מרכזי",
   "city": "ירושלים"
  },
  {
   "code": "91",
   "name": "נצרת",
   "city": "נצרת"
  },
  {
   "code": "92",
   "name": "נתניה",
   "city": "נתניה"
  },
  {
   "code": "96",
   "name": "כרמיאל",
   "city": "כרמיאל"
  },
  {
   "code": "97",
   "name": "עירון",
   "city": "אום אל-פחם"
  },
  {
   "code": "98",
   "name": "סחנין",
   "city": "סח'נין"
  }
 ],
 "59": [
  {
   "code": "1",
   "name": "משרד ראשי",
   "city": "חולון"
  }
 ],
 "99": [
  {
   "code": "1",
   "name": "ירושלים",
   "city": "ירושלים"
  }
 ]
};

export function getBranches(bankCode: string): BankBranch[] {
  return BANK_BRANCHES[bankCode] || [];
}
